import { Injectable } from '@angular/core';
import { Film, News, LikeFilm, MyFilm, MyNews, LikeNews, SoonFilms } from './film';

@Injectable({
  providedIn: 'root'
})

export class GlobalService {
myFilm: MyFilm[] = [];
likeFilm: LikeFilm[] = [];
myNews: MyNews[] = [];
likeNews: LikeNews[] = [];


soonFilms: SoonFilms[] = [
    {
        id: 1,
        poster: 'https://24tv.ua/resources/photos/news/610x344_DIR/201903/1129865.jpg?201903103613',
        name: 'Одного разу в Голлівуді'
    },
    {
        id: 2,
        poster: 'https://kinofilmpro.ru/wp-content/uploads/2019/02/chakki2-738x500.jpg',
        name: 'Дитячі ігри'
    },
    {
        id: 3,
        poster: 'https://www.kinofilms.ua/images/videos/mainpage/28223.jpg',
        name: 'Обіцянка на світанку'
    },
    {
        id: 4,
        poster: 'https://prm.ua/wp-content/uploads/2019/05/20180706142554e883a61443.jpg',
        name: 'Людина-павук: Далеко від дому'
    },
    {
        id: 5,
        poster: 'http://kinofilms.ua/images/videos/main/27757.jpg',
        name: 'Пригоди маленького Ремі'
    },
    
];
news: News[] = [
    {
        id: 1,
        view: false,
        title: '«МЕСНИКИ 4: ФІНАЛ» ЗМОГЛИ ВСТАНОВИТИ АБСОЛЮТНИЙ РЕКОРД',
        text: 'За кілька днів до прем\'єри проект «Месники 4: Фінал» зумів встановити новий абсолютний рекорд по числу попередньо проданих квитків серед картин, що випускаються на російському кіноринку. Офіційний прес-реліз ЄАІС говорить, що загальна сума попередньо реалізованих квитків на сеанси довгоочікуваної екранізації вже перевищили 128 мільйонів рублів. До слова, попередній рекорд був встановлений кінострічкою «Месники 3: Війна нескінченності», склавши 122 мільйон рублів. Зауважимо, що тоді йшлося про весь період, що передував прем\'єрі проекту. У нинішньому випадку росіянам доведеться чекати прем\'єри ще кілька днів. Зауважимо, що новий проект Marvel зумів встановити рекорди і на інших кіноринках. Подібні досягнення зафіксовані в Північній Америці, Південній Кореї, Китаї та інших країнах. Передбачається, що фільм зуміє зібрати рекордну суму за перший уїк-енд. Відзначимо, що екранізація вже сьогодні стартувала на більшості кіноринках',
        poster: 'https://my-travel-diary.by/wp-content/uploads/2019/04/2019042912291746122_7ryhso4ydxtbv1zuu3mtpheq0d5-1-1140x641.jpg' ,
        like: false,
        comment: []
    },
    {
        id: 2,
        view: false,
        title: 'ДЖЕЙМС ВАН ЗНОВУ БЕРЕТЬСЯ ЗА ЖАХИ',
        text: 'Постановник кінострічки «Аквамен» вирішив повернутися до відомого жанру. За інформацією західної преси, він має намір взяти на себе продюсерські функції в екранізації відомої книги Стівена Кінга «Жереб». Партнером Вана за проектом стане Гарі Доберман - раніше кінематографісти разом працювали над «заклятих».Відзначимо, що твір Кінга було представлено глядачам в 1975 році. Книга оповідала про письменника, повернення в рідну провінцію, щоб написати історію про місцеве покинутому особняку і побороти свої давні страхи. Головний герой з\'ясовує, що маєток придбав загадковий європеєць. Несподівано йому стає очевидно, що з городянами твориться щось жахливе. У 2004 році події книги вже переносилися на екрани. Нагадуємо, що в картині «Участь Салема» провідні ролі грали Джеймс Кромвелл, Рутгер Хауер, Дональд Сазерленд, Андре Брогер, Роб Лоу, Саманта Метіс і інші. Проект був досить популярний у глядачів. Поки невідомо, хто зніме нову версію - цілком ймовірно, що це буде Ван або Доберман. Також поки не названі терміни реалізації проекту.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133174_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 3,
        view: false,
        title: 'ГІЛЬЄРМО Дель ТОРО ЗАПРОШУЄ ДіКапріо в «Алею кошмар»',
        text: 'Знаменитий мексиканський постановник Гільєрмо Дель Торо планує екранізувати для компанії Fox Searchlight твір Вільяма Лінзі Грешема «Алея кошмарів». Режисер сподівається, що провідну роль погодиться на себе взяти Леонардо ДіКапріо. За даними ЗМІ, переговори вже стартували. Відзначимо, що сюжет першоджерела побудований навколо шахрая Стентона Карлайла, який стає учасником бродячого карнавалу, сподіваючись з\'ясувати таємницю фокусу відомої «жінки-медіума», яка заявляє, що вона здатна читати думки глядачів. Переживши безліч пригод, він домагається свого, і вирішує відкрити своє шоу, розраховуючи привернути увагу заможної публіки. Підсумок виявляється зовсім не тим, на який розраховував ключовий персонаж. Зауважимо, що в 1947 році вже був знятий фільм, який базується на цій книзі. У проекту був значний на ті часи бюджет, основна частина якого пішла на грандіозні декорації. Ключова роль була закріплена за Тайроном Пауером. Гільєрмо Дель Торо планує частково фінансувати роботу над новою кінострічкою, а також виступити її продюсером і автором сценарію. Ще не уточнена дата виходу фільму на екрани.',
        poster: 'https://mfst.igromania.ru/wp-content/uploads/2018/12/Vvodnaya.jpg',
        like: false,
        comment: []
    },
    {
        id: 4,
        view: false,
        title: 'Бен Аффлек ОБРАВ ДЛЯ СЕБЕ НОВИЙ РЕЖИСЕРСЬКИЙ ПРОЕКТ',
        text: 'Бен Аффлек, який зовсім недавно грав Темного лицаря в кінематографічної всесвіту DC, вирішив попрацювати над кінострічкою «Примарна армія». Повідомляється, що він виступить не тільки режисером проекту, але і виконавцем провідну роль, а також продюсером. Зарубіжна преса повідомляє, що проект буде базуватися на творі Елізабет Сейлз і Ріка Бейєра «Примарна армія Другої світової війни: Як одне надсекретний підрозділ обдурило ворога надувними танками, звуковими ефектами і іншими зухвалими підробками». Книга оповідає про надприродне підрозділі американської армії, що діє на французькій території в 1944 році. Використовуючи значну кількість надувний військової техніки та звукові ефекти, вони намагалися обдурити війська німців, змушуючи їх вести сили від Франції. На думку американських військових, такий прийом допомогла солдатам врятувати безліч життів. Поки немає інформації щодо термінів робіт над проектом. Адаптувати твір для широких екранів має намір Нік Піццолатто. Нагадуємо, що Аффлек деякий час назад повідомив, що не має наміру повертатися до образу Темного лицаря, хоча і не виключає своєї участі в якості постановника якогось Супергеройське фільму.',
        poster: 'http://cikave.ko.net.ua/wp-content/uploads/2017/03/1-4.jpg',
        like: false,
        comment: []
    },
    {
        id: 5,
        view: false,
        title: 'КІНГ ПОДІЛИВСЯ СВОЇМ ДУМКОЮ ПРО «ІГРИ ПРЕСТОЛІВ»',
        text: 'Відомий американський письменник Стівен Кінг вирішив висловити свою думку про перших серіях заключного сезону «Гра престолів». На свій сторінці в одній із соціальних мереж він опублікував невеликий відгук. «Будучи оповідачем зі значним досвідом, зізнаюся, що я в захваті від умов, що стоять за цим проектом. Їм вдалося легко і невимушено зібрати всіх ключових дійових осіб на Півночі, в Вінтерфелле », - зазначив автор. Зауважимо, що рейтинг першої серії нового сезону відзначився рекордами: в цілому, епізод викликав інтерес у 17,4 мільйона глядачів. Таким чином, минулий рекорд серіалу покращився на півмільйона. Другий епізод був прийнятий вже не з таким ажіотажем, проте його показники також виявилися високими. Котрий рік поспіль «Гра престолів» вважається одним з найуспішніших серіалів сучасності. Заключний сезон знімали в обстановці підвищеної секретності. Повідомлялося, що автори вирішили підготувати кілька фіналів, що не повідомляючи виконавцям провідних ролей, який з них стане остаточним.',
        poster: 'https://zik.ua/gallery/photo/k/i/king_stiven_53767504_epa.jpg',
        like: false,
        comment: []
    },
    {
        id: 6,
        view: false,
        title: 'КИТАЙСЬКІ ПІРАТИ ПОШИРЮЮТЬ КОПІЮ «Месники 4»',
        text: 'В інтернеті почали з\'являтися копії кінострічки «Месники 4: Фінал». За повідомленнями західної преси, в Китаї проект стартував на два дні раніше, ніж в Америці, і цим скористалися місцеві пірати. Повідомляється, що якість копій залишає бажати кращого: зображення містить водяні знаки грального сайту, повернуто відносно горизонтальної осі і постійно мерехтить. Звуковий супровід також не викличе захоплення у глядачів. Поки незрозуміло, якими будуть втрати в прокаті Китаю у зв\'язку з поширенням копій. Зауважимо, що на китайському кіноринку зафіксований рекордний попит на квитки в кінотеатри. У перший день фільму вдалося заробити в кінотеатрах Китаю понад 100 мільйонів доларів. Не виключено, що до завершення першого уїк-енду фільм зуміє встановити в Китаї абсолютний рекорд. Учасниками знімальної команди стали: Роберт Дауні мл., Джош Бролін, Том Холленд, Кріс Хемсворт, Скарлетт Йоханссон, Карен Гіллан, Кріс Еванс та інші актори.',
        poster: 'http://www.new.cineast.com.ua/wp-content/uploads/2019/04/d0bcd181d182d0b8d182d0b5d0bbd0b8-d184d0b8d0bdd0b0d0bb-d183d0b6d0b5-d183d181d182d0b0d0bdd0bed0b2d0b8d0bbd0b8-d0bad0b0d181d181d0bed0b2.jpg',
        like: false,
        comment: []
    },
    {
        id: 7,
        view: false,
        title: 'DISNEY ПОЗБУВАЄТЬСЯ ДЕЯКИХ ПРОЕКТІВ FOX',
        text: 'Закінчивши процес злиття з Fox, компанія Disney приступила до перевірки нових кінострічок, які опинилися в її розпорядженні. У список на вибування потрапила екранізація графічних новел «Мишача варта», а також картина з Томом Хенксом «Новини з усього світу». Також в плани студії не входить робота над адаптацією книги Енджі Томас «На підйомі». Найімовірніше, незабаром студія відмовиться від драматичного проекту з Вуді Харрельсон Fruit Loops. Джерела, наближені до компаній відзначають, що після злиття Disney приступила до сортування безлічі фільмів, запущених Fox. Тепер «Новини з усього світу» належать Universal, а Paramount придбала «На підйомі». Набагато менше пощастило «мишача варті». Зйомки повинні були стартувати вже в найближчі дні. На виробництво планувалося витратити близько 170 мільйонів доларів, але компанія вирішила не витрачати таку суму на кінострічку, засновану на далеко не найпопулярніших коміксах. При цьому відомо, що студія схвалила чимало інших проектів. Незабаром планується випуск приквела «Kingsman», а також ремейка «Вестсайдська історії». Також не вносилися корективи в знімальний графік «Аватара 2» - він і його сиквели будуть представлені в призначені терміни.' ,
        poster: 'https://www.movienewsnet.com/wp-content/uploads/2018/11/Disney-Fox.png',
        like: false,
        comment: []
    },
    {
        id: 8,
        view: false,
        title: 'МОСКВИЧІ ЗМОЖУТЬ ПОДИВИТИСЯ ФІНАЛ «Гри престолів» НА СТАДІОНІ',
        text: 'Мешканці Москви 20 Травня отримають можливість ознайомитися із заключною серією останнього сезону «Ігри престолів» у великій компанії. Епізод демонструватиметься на величезному екрані, розміщеному на території футбольного стадіону «РЖД Арена». До слова, показ від «Амедіатекі» буде проходити в один час зі світовою прем\'єрою. Також публіку чекає якась розважальна програма. «За період свого існування« Гра престолів »виявилася значущою частиною життя багатьох людей, і всім їм хочеться побачити, чим завершиться епічна сага. Вони чекають цього з завмиранням серця, і ми довго думали, як зможемо здивувати відданих шанувальників. У підсумку ми прийшли до висновку, що було б чудово зібратися разом, щоб побачити заключну серію знаменитої фентезі-саги. Ми це запам\'ятаємо назавжди. Висловлюємо окрему подяку ФК «Локомотив». Колеги з футбольного клубу допомогли нам виконати вражаючу роботу », - зазначає генеральний директор AMEDIA TV. Відвідати показ зможуть глядачі, які придбали підписку на онлайн-сервіс «Амедіатека» і залишили свою електронну пошту на got.thefinale.ru. Також запрошення будуть доступні передплатникам сервісу з преміальними картками Visa Platinum, Visa Infinite, Visa Signature зі знижкою 50%. Повідомляється, що кількість запрошень обмежена.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133194_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 9,
        view: false,
        title: 'Чверті «МЕСНИКИ» обійшли «ЗОРЯНІ ВІЙНИ»',
        text: 'Екранізація графічних новел Marvel «Месники 4: Фінал» з успіхом стартувала в міжнародному і домашньому прокаті. За свідченням західної преси, фільм вже встановив абсолютний рекорд в Північній Америці на нічних показах, заробивши 60 мільйонів доларів, і це істотно більше, ніж свого часу заробив попередній рекордсмен - сьома частина «Зоряних воєн». Заробітки за перший день прокату на батьківщині проекту склали приблизно 135 мільйонів доларів. Сформована ситуація свідчить про те, що новим «Месників», напевно, вдасться стати першим проектом в історії Північної Америки, який збере в перші вихідні понад 300 мільйонів доларів. Схожа сума може скоритися фільму на китайському ринку. Згідно ранніми прогнозами, в прем\'єрні вихідні картина збере в Китаї близько 270 мільйонів доларів. Втім, багато експертів переконані, що ця сума виявиться вище. Судячи з усього, фільм «Месники 4: Фінал» стане найуспішнішим американським проектом в китайському прокаті. Поки цей титул належить «Форсажу 8», що зібрав в Китаї 2 роки тому приблизно 392 мільйони доларів.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133210_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 10,
        view: false,
        title: 'В НОВІЙ ЧАСТИНИ бондіани АГЕНТ 007 ПІДЕ У ВІДСТАВКУ',
        text: 'Автори 25-й картини про Джеймса Бонда вирішили представити синопсис до проекту, а також оголосити повний склад акторів. Повідомляється, що в першій частині фільму з\'ясується, що Бонд пішов зі служби. Герой повністю змінює життя, перебравшись на Ямайку, але одного разу розмірені будні екс-агента захмарюються. Його старий приятелі Фелікс Ляйтер з ЦРУ потребує допомоги. Агенту доведеться потурбуватися порятунком талановитого вченого, і це завдання стає складніше, ніж очікувалося. Бонд сподівається відшукати таємничого лиходія, але ситуація непроста тому антагоніст володіє найсучаснішими технологіями. Автори проекту підтвердили, що провідна негативна роль закріплена за Рамі Малеком, недавно отримав свій перший «Оскар». Зірка "Богемської рапсодії" так коментує призначення: «Обіцяю, що містеру Бонду доведеться непросто в його 25-м пригоді». Також учасниками акторської команди стали Деніел Крейг, Бен Уішоу, Рорі Кіннер, Леа Сейду, Рейф Файнс, Наомі Харріс та інші. Нагадуємо, що прем\'єра фільму відбудеться в квітні наступного року.',
        poster: 'http://rs.img.com.ua/crop?v2=1&w=600&h=0&url=%2F%2Fbm.img.com.ua%2Fberlin%2Fstorage%2Ffinance%2Forig%2F1%2Fe1%2F4417b48825534ae9148a56144c050e11.jpg',
        like: false,
        comment: []
    },
    {
        id: 11,
        view: false,
        title: 'NETFLIX ПЕРЕТВОРИВ «Ненависну вісімку» В МІНІ-СЕРІАЛ',
        text: 'Раніше режисерський варіант вестерна Квентіна Тарантіно «Мерзенна вісімка» виходив лише в обмежений прокат і був недоступний більшості глядачів, але тепер все зміниться. З\'ясувалося, що користувачі Netflix отримають можливість побачити 187-хвилинну версію фільму в форматі своєрідного міні-серіалу, який буде поділений на чотири серії. До офіційної прем\'єри кінострічки Тарантіно випустив в обмежений прокат режисерську версію. Її демонстрували в кінотеатрах з 70-міліметровими проекторами. Після цього в широкому прокаті виявилася і стандартна версія, тривалістю в 168 хвилин. Глядачам Netflix доступний кожен з варіантів. Нагадуємо, що в «огидним вісімці» показані події однієї ночі, що трапилися в невеликому будинку на відшибі. Заметіль збирає там досить незвичайну компанію, в в якій присутні колишні військові, мисливці за головами і випадкові візитери. Їм доведеться провести разом кілька годин. Поступово атмосфера нагнітається, і стає очевидно, що найближчої ночі переживуть не всі. Варто визнати, що проект без праці буде розбитий на частини - постановник раніше сам розділив його на кілька глав. Нагадуємо, що вже наступного літа на широких екранах буде представлена нова кінострічка Таратіна - «Одного разу в Голлівуді» з Леонардо ДіКапріо і Бредом Піттом у головній ролі.',
        poster: 'https://image.zn.ua/media/images/645x426/Nov2015/131814.jpg',
        like: false,
        comment: []
    },
    {
        id: 12,
        view: false,
        title: '«МЕСНИКИ 4» ПРОДЕМОНСТРУВАЛИ РЕКОРД В МІЖНАРОДНОМУ ПРОКАТІ',
        text: 'Четвертої частини «Месників» вдалося впевнено стартувати майже на всіх ринках 25 квітня. За повідомленнями західних ЗМІ, за перші день картина змогла зібрати приблизно 169 мільйонів доларів. 8,5 мільйонів забезпечили глядачі Південної Кореї, 7 мільйонів - Австралія і 6 мільйонів - Франція. На американському кіноринку проект вийшов на день пізніше, і тут не обійшлося без рекордів: завершальна частина саги обійшла на старті попереднього рекордсмена - сьому частину «Зоряних воєн». За найбільш песимістичними прогнозами, до кінця першого уїк-енду картина збере в світовому прокаті приблизно 800 мільйонів доларів. Однак більшість експертів все ж сходяться на думці, що цей показник буде істотно покращено. Учасниками акторської команд виявилися такі знамениті актори, як Кріс Хемсворт, Роберт Дауні мл., Том Холленд Джош Бролін, Еванджелін Ліллі, Скарлетт Йоханссон, Брі Ларсон, Кріс Еванс, Карен Гіллан і багато інших. Постановниками проекту стали Ентоні і Джо Руссо.',
        poster: 'https://i0.wp.com/bookmaker-ratings.ru/wp-content/uploads/2019/04/novosti3-4.png?resize=730%2C540&ssl=1',
        like: false,
        comment: []
    },
    {
        id: 13,
        view: false,
        title: 'Ідріс Ельба одружився',
        text: 'Відомий британський актор Ідріс Ельба офіційно одружився. Фото з весілля були представлені в британській версії видання Vogue. Дружиною знаменитості виявилася 29-річна модель Сабріна Дору. Церемонія одруження проходила в Марокко. Наречена постала перед гостями в класичному білому платті з відкритими плечима від дизайнера Віри Вонг. У другій половині дня вона одягалася в сукню, вишиту дорогоцінними каменями і перлами. В цілому торжество розтягнулося на три дні, однак на ньому були присутні лише родичі та близькі друзі пари. Нагадуємо, що актор зробив пропозицію руки і серця публічно в минулому році. Він опустився перед Сабріною на одне коліно перед показом своєї кінострічки у кінотеатрі «Ріо» (Східний Лондон). Незабаром шанувальники актора зможуть побачити його на великих екранах. Влітку нинішнього року буде представлений бойовик «Хоббс і Шоу» з його участю.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133225_slide_1.jpg',
        like: false,
        comment: []
    },
    {
        id: 14,
        view: false,
        title: '«ДЮНА» буде поділено на ЧАСТИНИ',
        text: 'Джошуа Гроуд, який очолює компанію Legendary, в недавньому інтерв\'ю підтвердив, що екранізація «Дюни» Френка Герберта буде представлена в декількох частинах. Спочатку Дені Вільньов попрацює над першою картиною, в якій буде розказана передісторія світу, а потім вже візьметься за продовження. «Ми так запланували. Без передісторії нікуди, хоч в книгах на неї були тільки натяки. Ми вирішили її розширити. До того ж, коли читаєш роман, там є цілком логічне місце, де можна пригальмувати », - зазначив Гроуд. Про бажання розділити екранізацію режисер вже згадував. На його думку, в один повнометражний фільм не вдасться вшити дію всієї книги. Судячи з усього, компанія має намір підстрахуватися і взятися за повноцінну роботу над другою частиною, коли перша якось проявить себе в прокаті. Ключова роль в картині бере на себе Тімоті Шаламов. Також в проекті гратимуть Оскар Айзек, Стеллан Скарсгард, Джейсон Момоа, Хав\'єр Бардем, Джош Бролін і інші. Нагадуємо, що вихід першої частини очікується в наступному році.',
        poster: 'https://cdn.maximonline.ru/3f/d0/db/3fd0dba6ccf6f130ae03b8870cb35ec7/1196x830_1_f054afb75aa90763154257cc41c858be@1196x830_0xac120002_10604068281550587722.jpg',
        like: false,
        comment: []
    },
    {
        id: 15,
        view: false,
        title: 'Американська кіноакадемія внесла зміни в СВІЙ РЕГЛАМЕНТ',
        text: 'Американська Кіноакадемія вирішила внести деякі зміни в регламент своєї премії. За інформацією офіційного прес-релізу, номінація «кращий фільм іноземною мовою» перейменована. Тепер вона буде називатися так: «Кращий міжнародний повнометражний фільм». «Ми прийшли до висновку, що слово« іноземний »в цьому контексті дещо застаріла. Його не використовують в світовому співтоваристві кінематографістів. Ми вважаємо, що нове визначення кращим чином представить цю категорію і сприятиме позитивному і інклюзивної погляду на світ кіно », - відзначили представники Кіноакадемії. Також повідомлялося, що зміна назви не вплине на вимоги, які будуть пред\'являтися до претендентів на премію. Крім того зміни сталися і в номінації «кращий анімаційний фільм». Відзначається, що тепер немає вимоги, згідно з яким претендентами на премію могли бути мультфільми, що вийшли в прокат протягом календарного року. Наступна церемонія «Оскар 2020» відбудеться 9 лютого наступного року в Dolby Theatre (Голлівуд). Поки невідомо, чи будуть продюсери призначати ведучого церемонії.',
        poster: 'https://kinoafisha.ua/upload/2019/04/news/nc8/db/69927/b_1zhm4r1jamerikanskaya-kinoakademiya-vnesla-izmeneniya-v-reglament-premii-oskar-.jpg',
        like: false,
        comment: []
    },
    {
        id: 16,
        view: false,
        title: 'Пітер Фарреллі ОБРАВ ДЛЯ СЕБЕ НАСТУПНИЙ ПРОЕКТ',
        text: 'Пітер Фарреллі, який раніше працював над проектами «Зелена книга» і «Тупий і ще тупіший», визначився з новим для себе проектом. Повідомляється, що в його основі лежатимуть мемуари Джона Донохью під назвою «Найбільший пивний забіг: Правдива історія дружби, яка сильніше війни». Твір повідало про те, як в 1967 році Донохью покинув Нью-Йорк, щоб відшукати друзів дитинства і пропустити з ними по пару кухлів пива. Несподівано він з\'ясовує, що хлопці, яких він шукає, вже встигли стати учасниками В\'єтнамської війни. Фарреллі доведеться опинитися не тільки режисером фільму, але і одним з авторів сценарію. Виробництвом проекту займеться студія Skydance. Нагадуємо, що останній, на сьогоднішній день, проект режисера «Зеленная книга» вийшов кілька місяців тому. Драма, в якій знялися Вігго Мортенсен і Махершала Алі, була заснована на реальних подіях і розповідала історію подорожі джазового музиканта Дона Ширлі (Алі), компанію якому склав його водій Тоні Валлелонга (Мортенсен). Нагадуємо, що «Зелена книга», на премії «Оскар 2019» отримала кілька нагород, і одна з них була за «найкращий фільм року».',
        poster: 'https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Peter_Farrelly_and_Bobby_Farrelly_at_the_2009_Tribeca_Film_Festival.jpg/1200px-Peter_Farrelly_and_Bobby_Farrelly_at_the_2009_Tribeca_Film_Festival.jpg',
        like: false,
        comment: []
    },
    {
        id: 17,
        view: false,
        title: 'Алісія Вікандер зніметься у фільмі «НАРОДЖЕНИЙ бути вбитим»',
        text: 'Алісія Вікандер і Джон Девід Вашингтон стали учасниками акторської команди проекту «Народжений бути вбитим», продюсером якого виступить постановник фільму «Клич мене своїм ім\'ям» Лука Гуаданьїно. Повідомляється, що акторам доведеться зіграти пару, яка вирушила на відпочинок до Афін, де героям належить стати жертвами змови. Режисером проекту призначений Фердінандо Чіто Філомаріно, який раніше працював над створенням проектів «Суспірія», «Клич мене своїм ім\'ям», «Великий сплеск». Зауважимо, що режисерську діяльність Філомаріно почав з картини «Антонія», яка оповідала про останні роки життя Антонії Поцці. Постановник зазначає, що новий фільм стане його англомовним дебютом. Кінематографіст обіцяє продемонструвати власне бачення «трилера, присвяченого полюванні на людей». Сейомбху Мукдіпром, який брав участь в зйомках «Антонії» і «Клич мене своїм ім\'ям», виступить оператором нової кінострічки. Рюіті Сакамото призначений композитором фільму - раніше він працював над такими хітами, як «вижив», «Під покровом небес», «Останній імператор». Точні терміни реалізації трилера поки не названі.' ,
        poster: 'http://www.spletnik.ru/img/2018/02/polly/hm/20180301-alicia-post.jpg',
        like: false,
        comment: []
    },
    {
        id: 18,
        view: false,
        title: '«ДІЄТА ІЗ САНТА-Кларіто» ЗАВЕРШУЄТЬСЯ',
        text: 'Всупереч безлічі позитивних відгуків глядачів і критиків, потоковий сервіс Netflix прийняв рішення завершити шоу «Дієта з Санта-Кларіта» третім сезоном. Сюжет комедії обертається навколо пари канібалів, які проживають в невеликій провінції, і хто знає, як впоратися зі своїми хворими бажаннями. В кінці березня шанувальником було представлено десять фінальних епізодів. Провідні ролі проекту взяли на себе такі відомі актори, як Дрю Беррімор і Тімоті Оліфант. «Звичайно, нам буде не вистачати проекту, але в першу чергу ми горді тим, що встигли зробити. Ми цінуємо ту підтримку і любов, яку надавали глядачі. Якби це залежало від них, безумовно, Шила і Джоел, головні герої цієї історії, прожили б ще тисячі років », - резюмував автор серіалу Віктор Фреско. Зауважимо, що за останній час це не перший випадок відміни потоковим сервісом проекту, який мав успіх у глядачів. Раніше Netflix аналогічним чином попрощався з шоу «Живемо сьогоднішнім днем», чим дуже засмутив глядачів, і особливо кубино-американську аудиторію. Також були закриті «Любов», «Вибухова штучка», «Раскосяченние».',
        poster: 'https://filmix.co/uploads/sliderPics/post_133268_slide_1.jpg',
        like: false,
        comment: []
    },
    {
        id: 19,
        view: false,
        title: 'Хлоя Морец ЗІГРАЄ У повнометражному ПРОЕКТ «ТОМ І ДЖЕРРІ»',
        text: 'Хлоя Грейс Морец намір взяти участь в зйомках повнометражного проекту «Том і Джеррі». За інформацією ЗМІ, актриса візьме на себе роль співробітниці престижного готелю. Отже, в установі, де працює Кайла, з\'являється мишеня Джері. Ця обставина може зіпсувати репутацію готелю, в якому за кілька днів має відбутися розкішне весілля. Розуміючи, що проблему потрібно вирішити якомога швидше, героїня приносить в будинок вуличного кота Тома, сподіваючись, що той швидко ліквідує гризуна. Героїв чекає не тільки протистояння, але і несподіваний союз проти деспотичного начальника Кайли. Повідомляється, що в кінострічці знаменитий кіт і мишеня зображатимуться за допомогою комп\'ютерної графіки. До того ж, як і в оригіналі, вони залишаться «німими». Виробництвом картини займається студія Warner Bros. Поки немає інформації про дату прем\'єри фільму. Режисером призначений Тім Сторі. Нагадуємо, що нещодавно Морец знялася в таких фільмах, як «Суспірія», «Неправильне виховання Кемерон Пост».',
        poster: 'https://filmix.co/uploads/sliderPics/post_133269_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 20,
        view: false,
        title: 'МІГЕЛЬ Сапочник РОЗПОВІВ, ЯК ПРАЦЮВАВ НАД БИТВОЮ ЗА Вінтерфелла',
        text: 'Мігель Сапочник, який зняв третю серію нового сезону «Ігри престолів», розповів, який він спочатку бачив битву за Вінтерфелл. Режисер зазначає: «Це хоррор на виживання ... Ми знайшли місце і для справжніх жахів, і для екшна, і для саспенсу, і для драми. Ми не хотіли знімати просто нескінченні вбивства, щоб фанати не втратили чутливість ». Також кінематографіст зазначив, що зйомки тривали майже три місяці. Приступаючи до роботи, Сапочник був натхненний епізодами облоги з другої частини «Володаря кілець». Сам постановник резюмує: «Вважаю, ця сцена займає близько 40 хвилин, однак мова йде про три битвах йдуть паралельно. Нам необхідно було детально оцінити кожен ряд кадрів, і задати собі питання: «Навіщо я дивлюся це ?. В результаті я прийшов до думки, що багато екшну не потрібно. У якийсь момент приходить усвідомлення, що глядач може втомитися ». Зауважимо, що хронометраж серії зайняв близько 1 години 22 хвилин. При цьому бойових сцен було відведено годину. Три роки тому саме Сапочник знімав наймасштабнішу серію шостого сезону - «Битву Бастардо».',
        poster: 'https://filmix.co/uploads/sliderPics/post_133270_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 21,
        view: false,
        title: 'ОПЕРАТОР «Гри престолів» РОЗПОВІВ, ЧОМУ ТРЕТЯ СЕРІЯ БУЛА «ТЕМНОЮ»',
        text: 'Фабіан Вагнер - оператор, який знімав кілька серій відомого проекту «Гра престолів», включаючи той, який піддався критиці глядачів за темне зображення. Кінематографіст заявляє: «Ми хотіли створити приголомшливу серію для публіки. І дуже темною вона не була. Я точно знаю це, адже я сам її і знімав », - заявляє він. Також Вагнер відзначає, що на істотну втрату якості вплинула компресія оригінального відеоряду, за яку відповідає канал НВО. До того ж додаткова пикселизация картинки цілком могла з\'явитися через недостатньо широкого інтернет-каналу. Оператор нагадав шанувальникам шоу, що «Гра престолів», по своїй суті, є «похмурим серіалом», і його бажано дивитися в максимально затемненому приміщенні. Крім того, він не рекомендує дивитися епізоди проекту «на телефонах» і вивчити налаштування телевізорів. Зауважимо, що багато фанатів шоу скаржилися в Мережі на те, що деякі сцени, присвячені битві за Вінтерфелл, вони не змогли розібрати через занадто темного зображення. На сьогоднішній день вийшло три серії восьмого сезону.',
        poster: 'https://www.film.ru/sites/default/files/persones/_imported/1234835.jpg',
        like: false,
        comment: []
    },
    {
        id: 22,
        view: false,
        title: 'У бойовику «ФОРСАЖ: Хоббс І ШОУ» ГЛЯДАЧІВ ЧЕКАЄ НЕСПОДІВАНКА',
        text: 'Для глядачів, які чекають прем\'єри першого спін-офф «Форсажу», бойовика «Форсаж: Хоббс і Шоу», приготований якийсь сюрприз. За заявами західних ЗМІ, у фільмі очікується суперлиходії, роль якого дісталася знаменитому акторові Голлівуду. За запевненням анонімних джерел, мова йде про Кіану Рівза, якого нібито і дістався образ «організатора всіх неприємностей, які чекають ключових персонажів». Поки ці відомості не отримали офіційного підтвердження. Нагадуємо, що Девід Літч, є постановником проекту, раніше вже працював із зіркою «Матриці» над відомим бойовиком «Джон Вік». Також у фільмі знялися такі знаменитості, як Ідріс Ельба, Дуейн Джонсон, Ванесса Кірбі, Джейсон Стетхем, Едді Марсан, Хелена Холмс, Ейса Гонсалес та інші. Прем\'єра кінострічки відбудеться 1 серпня нинішнього року. Якщо бойовик буде успішним у прокаті, його автори припускають зйомки другої частини.' ,
        poster: 'https://filmix.co/uploads/sliderPics/post_133282_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 23,
        view: false,
        title: 'ДЖОН СІНА МОЖЕ долучитися до «Форсажу»',
        text: 'Він Дізель зробив очевидний натяк на те, що до знімальній команді популярного бойовика «Форсаж» може долучитися нова дійова особа. Судячи з відеоролику, представленому на особистій сторінці Дизеля в одній із соціальних мереж, мова йде про знаменитого рестлере, телевізійному провідному і актора Джона Сіна. «Друзі, вам відомо, що я дуже відповідальний і завжди досить швидко міркую, коли мова йде про створення чогось знакового. Можливо, це прозвучить шалено, проте кожен повний місяць я відчуваю, що Пабло посилає мені нового солдата, ще когось, хто стане борцем за правду ... сьогодні цей хтось з\'явився в спортзалі Торетто », - заявив Дизель, направляючи камеру на зірку« Бамблби ». Зауважимо, що прізвисько Пабло належало Полу Уокеру, партнеру Дизеля по «Форсажу», який загинув в автокатастрофі. До слова, актори були близькими друзями. Поки невідомо, яка саме роль дістанеться Синьо. Ймовірно, таким поповненням Вин Дизель має намір компенсувати відсутність Дуейна Джонсона, який чи не з\'явиться в новій частині «Форсажа». Нагадуємо, що раніше повідомлялося про численні конфлікти, що виникли між Дизелем і Джонсоном на знімальному майданчику. Дев\'ята частина «Форсажу» очікується на великих екранах в наступному році. У нинішньому році вийде перший спін-офф бойовика - «Форсаж: Хоббс і Шоу».' ,
        poster: 'https://filmix.co/uploads/sliderPics/post_133284_slide_2.jpg',
        like: false,
        comment: []
    },
    {
        id: 24,
        view: false,
        title: 'ПРОФЕСІЙНІ домінатрікс НЕ В ЗАХВАТІ ВІД ПРОЕКТУ NETFLIX',
        text: 'У минулому місяці сервіс Netflix представив публіці проект Bonding. Сюжет сфокусований на аспіранткою, яка підробляє домінатрікс. Своїм асистентом вона наймає шкільного приятеля-гея. Відзначається, що при створенні Bonding його автор надихнувся своїм досвідом, і проект вже обзавівся чималою кількістю фанатів, але, судячи з усього, професійних домінатрікс серед них немає. До слова, останні заявили, що новий продукт сервісу завдає шкоди образу БДСМ, насаджуючи безліч стереотипів. Безліч користувачів мереж, які зараховують себе до домінатрікс, вже висловилися з цього приводу в коментарях до проекту. Багато з них сходяться на думці, що навіть якщо автори хотіли зробити серіал, який буде лише частково ґрунтуватися на правді, то це можна було організувати краще. Також наголошується, що Bonding навіть приблизно не передати реалії життя сексуальних рабів. Зауважимо, що, за словами продюсерів, у них була мета зробити комедію, а не деталізувати реальне життя домінатрікс.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133309_slide_0.jpg',
        like: false,
        comment: []
    },
{
        id: 25,
        view: false,
        title: 'Елізабет ОЛСЕН РОЗПОВІЛА ПРО СЕРІАЛ червона відьма',
        text: 'У недавній розмові з журналістами Елізабет Олсен, відома роллю Червоної Відьми, розповіла про новому серіалі Disney + «Ванда / Вижен». Актриса зазначила, що стилістика, напевно, буде витримуватися в дусі 1950-х. «Сюжет буде фокусуватися на ДОРОЗІ і Ванді. Як джерела будуть використані кілька коміксів. Під час обговорень я точно бачила знімок з нами з 50-х », - говорить знаменитість. Крім того вона зазначила, що загальний хронометраж серіалу склав близько шести годин, а знімальний процес почнеться вже восени нинішнього року. Нагадуємо, що вперше Ванда (Алая Відьма) був представлена глядачам в 2015 році в проекті «Месники: Ера Альтрон». У героїні є безліч здібностей, в числі яких вплив на свідомість і телекінез. Дебютувала героїня як антагоністкі, але досить швидко виявилася в рядах Месників. Як відомо шанувальникам знаменитої кіновсесвіту, Вижен є сінтезоідом, над яким працював Альтрон. Той хотів створити для себе ідеальне тіло, але втручання Месників не дало йому перенести свідомість в нову оболонку. В результаті НА ДОРОЗІ вдалося знайти власне свідомість і також примкнути до рядів Месників. Крім проекту про вже згаданих персонажів, на новому сервісі будуть представлені і інші серіали про героїв кіновсесвіту Marvel. Як відомо, в одному з них буде розказано про Локі, а сюжет другого сфокусується на Соколі і Зимовому Солдата. Також деякі ЗМІ припускають, що сервіс може запустити серіал і про Соколиному Око.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133311_slide_0.jpg',
        like: false,
        comment: []
    },
{
        id: 26,
        view: false,
        title: 'РОБОТа над сольною картиною про Бетмена відкладається',
        text: 'Знімальний процес сольною картини про Темному лицарі, який раніше планувалося почати восени нинішнього року, переноситься. За повідомленнями західних ЗМІ, сценарій фільму відправляється на доопрацювання. Судячи з усього, виробництво почнеться не раніше наступного року. Поки не було офіційних коментарів із цього приводу. Зауважимо, що деякий час тому режисер фільму, Метт Рівз, заявляв шанувальником коміксів, що старт зйомок запланований на кінець нинішнього року. Крім того нагадаємо, що компанія Warner Bros. мала намір взятися за створення сольною картини про Темному лицарі ще в ті часи, коли режисером і виконавцем ключової ролі екранізації був Бен Аффлек. Згодом, проблеми з алкоголем і особистим життям змусили знаменитість залишити обидві посади. До слова, Аффлек також сподівався створити сценарій для проекту, але студія не схвалила його. Поки неясно, чи вплинуть ці перестановки на намічений прокатний графік. Нагадуємо, що раніше компанія Warner Bros. заявляла про готовність випустити фільм 25 червня 2021 року.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133323_slide_2.jpg',
        like: false,
        comment: []
    },
{
        id: 27,
        view: false,
        title: 'ЕКСПЕРТИ ПРОГНОЗУЮТЬ УСПІХ «ІСТОРІЇ ІГРАШОК 4»',
        text: 'Судячи з попередніми прогнозами щодо стартових зборів анімаційної картини «Історія іграшок 4» від Pixar, у неї є всі шанси показати кращий результат серії. Аналітики Boxoffice Pro прийшли до висновку, що за перший уїк-енд мультик збере на батьківщині приблизно 100-130 мільйонів доларів. Одним з аспектів, що впливають на подібний результат, вважається загальна популярність франшизи протягом тривалого часу і бажання багатьох батьків познайомити зі знаменитими героями нове покоління глядачів. Крім того береться до уваги і позитивна реакція на представлені раніше трейлери. Можливими перешкодами в досягненні значної каси називаються не дуже вдало обрана дата прем\'єри. Як відомо четверта частина мультфільму виходить приблизно в один час з проектом «Таємне життя домашніх тварин 2». Третя частина «Історії іграшок» вийшла на екрани ще дев\'ять років тому. Стартові збори фільму в американському прокаті досягли позначки в 110 мільйонів доларів. В цілому мультику вдалося заробити більше 1 мільярда доларів. Нагадуємо, що прем\'єра проекту відбудеться в червні нинішнього року.' ,
        poster: 'https://filmix.co/uploads/sliderPics/post_133326_slide_0.jpg',
        like: false,
        comment: []
    },
{
        id: 28,
        view: false,
        title: 'ЕКСПЕРТИ РОБЛЯТЬ СТАВКИ НА СТАРТ «Аладдін»',
        text: 'Кінострічка компанії Walt Disney «Аладдін» може відзначитися на батьківщині досить значним стартом. Згідно зі статистикою Deadline, касові збори картини можуть досягти в перші вихідні позначки від 70 до 90 мільйонів доларів. У разі здійснення цього прогнозу, «Аладдін» покаже себе краще таких казок компанії, як «Малефісент» і «Попелюшка», які раніше стартували на американському ринку з підсумком приблизно в 68 мільйонів доларів кожна. Втім, по більш оптимістичними прогнозами, картині і зовсім вдасться наблизитися до позначки в 100 мільйонів доларів. Нагадуємо, що «Аладдину» належить стати другою кінострічкою в нинішньому році, яка створювалася на базі класичних анімаційних проектів. Першим був ігровий варіант «Дамбо», якому не вдалося повторити результат оригіналу. У липні очікується вихід «Короля лева», знятого постановником Джоном Фавро. У роботі над «Аладдіном» брали участь Уілл Сміт, Назим Педрад, Біллі Магнуссен, Навід Негабан, Мена Массуд, Марван Кензарі, Бернард Коллако, Каміль Лемешевська та інші актори. Режисером фільму став Гай Річі. Прем\'єра намічена на 23 травня поточного року.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133342_slide_4.jpg',
        like: false,
        comment: []
    },
{
        id: 29,
        view: false,
        title: 'ДЕВ\'ЯТИЙ ФІЛЬМ ТАРАНТІНО ПОКАЖУТЬ У Каннах',
        text: 'Світова прем\'єра дев\'ятої кінострічки Квентіна Тарантіно «Одного разу ... в Голлівуді» відбудеться в рамках чергового Каннського фестивалю. Повідомляється, що проект, що розповідає про голлівудського життя кінця 1960-х, виявився в основному конкурсі кіноогляду. Основна програма була оголошена ще два тижні тому директором фестивалю Тьєррі Фремо, але тоді не було мови про фільм Тарантіно. Вся справа в тому, що кінематографіст на той час не закінчив монтаж. Однак зараз Фремо зазначає, що режисер, який кілька місяців посилено працює в монтажній, встигне завершити роботу до моменту старту фестивалю. Варто відзначити, що кінематографіст неодноразово заявляв, як йому дуже хотілося б повернутися на Лазурний берег через чверть століття після того, як в Каннах відбулася прем\'єра «Кримінального чтива». Нагадуємо, що тоді другий фільм режисера, представлений в 1994 році, заслужив «Золоту пальмову гілку». Передбачається, що крім постановника на 72-й Каннський кінофестиваль прибудуть зірки «Одного разу ... в Голлівуді». У проекті знімалися такі знаменитості, як Леонардо ДіКапріо, Бред Пітт, Марго Роббі, Аль Пачіно та багато інших. Поява зірок такої величини, безсумнівно, приверне велику увагу публіки.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133344_slide_0.jpg',
        like: false,
        comment: []
    },
{
        id: 30,
        view: false,
        title: 'Шейлін Вудлі ОТРИМАЛА РОЛЬ ДЕТЕКТИВА',
        text: 'Шейлін Вудлі належить узяти на себе роль детектива, який намагається вийти на слід серійного маніяка. Актриса зіграє у фільмі «Мізантроп», постановником якого призначений Даміен Шіфрон, який раніше працював над «Дикими історіями». За виробництво фільму відповідає компанія FilmNation. Знімальний процес стартує в Атланті в нинішньому році. Фільм базується на оригінальній історії, яку придумав сам Шіфрон. Сюжет буде сфокусований на талановитої співробітниці поліції з непростим характером. До неї звертається ФБР, просячи допомоги в затриманні жорстокого вбивці. На даний момент йдуть проби на другорядні ролі. Сама Вудлі зазначає: «Не часто зустрінеш випадки, щоб сценарії, видатні за змістом і за формою, на чолі мали постановника такого калібру. У мене немає сумнівів, що ми зуміємо створити щось дивовижне і вражаюче. Це буде непросто, але ми постараємося. Я неймовірно щаслива виявитися частиною цієї історії ». Відзначимо, що також знаменитість можна буде побачити через місяць на екранах у другому сезоні проекту «Велика маленька брехня».' ,
        poster: 'https://filmix.co/uploads/sliderPics/post_133345_slide_0.jpg',
        like: false,
        comment: []
    },
{
        id: 31,
        view: false,
        title: 'Кевін Костнер НЕ ЗАДОВОЛЕНИЙ ПОЛОЖЕННЯМ У США',
        text: 'Відомий актор Голлівуду Кевін Костнер виступив з критикою щодо сучасної політичної системи і громадських відносини США. У недавній розмові з журналістами він заявив: «Поточне політичне становище зовсім невпізнанно для мене. Мені навіть соромно за нього ». За словами актора, він сподівається на те, що в доступному для огляду майбутньому ситуація дещо покращиться. «Я вважаю Америку найбільшим експериментом в історії людства. Велика ідея ще жива, вона не зникла. Людям все ще хочеться побувати тут, однак ми вже давно втратили першість у тому, що дійсно важливо. Ми почали переоцінювати себе. У нас одночасно живе приземленість і велич. Наш егоїзм не дає нам знову знайти першість », - заявляє знаменитість. Зауважимо, що Кевін Костнер ніколи не приховував, що вважає кращим президентом Барака Обаму. Серед останніх акторських робіт актора участь в проектах «Йеллоустоун» і «Розбійники з великої дороги».',
        poster: 'https://filmix.co/uploads/sliderPics/post_133360_slide_0.jpg',
        like: false,
        comment: []
    },
{
        id: 32,
        view: false,
        title: 'Ентоні Хопкінс І ОЛІВІЯ Колман ПОГОДИЛИСЯ НА «БАТЬКА»',
        text: 'Ентоні Хопкінс і Олівія Колман, є лауреатами премії «Оскар», мають намір взяти на себе провідні ролі в драматичній картині «Батько», що базується на відомій театральній п\'єсі. Повідомляється, що зірці «Мовчання ягнят» доведеться грати батька героїні Колман. Персонаж Хопкінса описується як «незалежний і пустотливий людина». Чоловік відмовляється від будь-якої участі та допомоги дочки, незважаючи на свій похилий вік. Одного разу з\'ясовується, що герою все ж не обійтися без Енн. Справа в тому, що у нього з\'явилися великі сумніви у своїй родині, розумі і реальності. Режисером проекту призначений Флоріан Зеллер, що є автором оригінальної п\'єси. Над сценарієм працював Крістофер Хемптон, раніше відзначився драматургією до «Спокуті» і «Небезпечного методу». Поки немає інформації про знімальному графіку проекту. Робота почнеться вже наступного літа. Прем\'єра картини намічена на наступний рік.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133361_slide_0.jpg',
        like: false,
        comment: []
    },
{
        id: 33,
        view: false,
        title: 'Джаред Лето ЗРОБИВ ВИСНОВКИ Про MARVEL І DC',
        text: 'Відомий голлівудський актор Джаред Лето, який працює над картиною «Морбіус, живий вампір» за мотивами графічних новел Marvel, вирішив порівняти дві популярні кінематографічні всесвіти. Актор прийшов до висновку, що проекти DC можна назвати менш успішними, ніж екранізації конкурентів. «Безумовно, це так, і Джейсон Момоа це зможе підтвердити. До того ж мені здається, що одна з найвидатніших картин - це «Чудо-жінка». Вона феноменальна, неймовірна постановка. Світ DC неймовірно значний і вже дуже давно. Однак неможливо завжди вигравати. Але в цілому, у них все добре. Ось і «Шазам!» Недавній не підвів », - резюмує знаменитість. До слова, і сам Літо мав відношення до розвитку DC, взявши участь в проекті «Загін самогубців» в образі Джокера. Ця версія знаменитого лиходія коміксів не викликало бурхливого захоплення у більшості шанувальників DC. Втім, сам Літо не виключає, що коли-небудь може знову взятися за цю роль, уточнивши, що все залежить від сценарію і «інших обставин». Нагадуємо, що нову версію «Загону самогубців» готовий зняти Джеймс Ганн. У свою чергу, «Морбіус, живий вампір» виявиться на екранах влітку наступного року.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133362_slide_0.jpg',
        like: false,
        comment: []
    },
{
        id: 34,
        view: false,
        title: 'РЕЖИСЕРИ ПРОЕКТУ «МЕСНИКИ 4» РОЗЧАРОВАНІ ЙОГО касовим успіхом',
        text: 'Вражаючі касові успіхи картини «Месники 4: Фінал», в деякому роді розчарували її авторів, брати Руссо, так як розмови про рекорди поступово витіснили всі інші достоїнства картини. Таке визнання було зроблено кінематографістами в недавньому інтерв\'ю. «Не буду приховувати. Я трохи розчарований, що проект стартував настільки вражаюче. Його неймовірні касові збори панують в обговореннях, хоча і не є найцікавішою частиною історії », - зауважив Ентоні Руссо. «Завжди згадується динаміка подібних фільмів на ринку. Їх результати постійно обговорюють. Побив чи фільм рекорд, випередив він попередній. Для розвитку кіно це, звичайно ж, важливо. Безумовно, у нас була надія на те, що міжнародний рекорд буде побитий. Крім цього були надії і на те, що він перевершить досягнення на внутрішньому ринку, обійде в цьому плані «Війну нескінченності». В іншому випадку деякі люди сприйняли б це провалом. Звичайно ж, це безумство, коли спочатку на кінострічку виявляється такий тиск », - зазначає Джо Руссо. Нагадуємо, що прем\'єра фільму відбулася в кінці минулого місяця.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133390_slide_0.jpg',
        like: false,
        comment: []
    },
{
        id: 35,
        view: false,
        title: 'СЕРІАЛ NETFLIX ДОВОДИТЬ ДО САМОГУБСТВА',
        text: 'Дані, наведені Національним інститутом охорони здоров\'я, вказують на те, що серіал Netflix «13 причин чому» досить шкідливий для підростаючого покоління. Нагадуємо, що прем\'єра шоу відбулася два роки тому. Тепер же вчені переконані, що через проект збільшилася кількість самогубств серед юних глядачів у віці від 10 до 17 років. Дослідники заявляють, що через місяць після прем\'єри шоу число суїцидів у зазначеній вікової групи зросла на 28% і досягло максимуму за останні кілька років. Раніше вже проводилися дослідження, які намагаються довести взаємозв\'язок між серіалом і підлітковими суїцидами. У 2017 році були ініційовані досліди, в результаті яких вивчалися пошукові запити, які якимось чином вказували на зв\'язок з поняттям «самогубство». Вчені заявили, що число користувачів, що намагаються дізнатися щось нове про суїцид, істотно зросла після прем\'єри шоу. Тоді не вдалося довести, що ці аспекти якось взаємопов\'язані. Представники Netflix відзначили, що бачили опубліковані дані і зараз зайняті їх вивченням. Однак при цьому сервіс нагадав Національному інституту охорони здоров\'я, що їх дані йдуть врозріз з інформацією, опублікованою Університетом Пенсільванії. До слова, мова йде про дослідження, яке виявило, що підлітки, які дивилися серіал, менш схильні до суїциду, на відміну від однолітків, які його не бачили.',
        poster: 'https://ruconsole.com/wp-content/uploads/2018/05/Netflix-1-10.jpg',
        like: false,
        comment: []
    },
    {
        id: 36,
        view: false,
        title: 'КРИТИКИ ЗАДОВОЛЕНІ ПРОЕКТОМ «ПОКЕМОН. ДЕТЕКТИВ Пікачу»',
        text: 'Фантастична картина «Покемон. Детектив Пікачу »отримала переважно позитивні відгуки західних критиків. За свідченням Rotten Tomatoes, картина отримала приблизно 70% рейтингу на основі перших сорока рецензій. «Детектив Пікачу - веселий, часом дуже смішний, але найчастіше просто красивий дитячий проект, який не ображає інтелект публіки. Він показує позитивний приклад », - коментує видання The Playlist. «Чарівна та легка адаптація. Деталі сповнені гумору, які зміцнюють любов до покемонам », - переконаний автор з Collider. «Цей фільм дуже зобов\'язаний Райану Рейнольдсу, це неможливо переоцінити. Навіть якщо вам незрозумілий світ Пікачу, ви, звичайно ж, зможете оцінити відмінні жарти, вставлені до місця », - зазначає представник Empire. Нагадуємо, що в екранізації взяли участь Райан Рейнольдс, Рита Ора, Джастіс Сміт, Кріс Гір, Бернардо Сантос, Кен Ватанабе та інші. На вітчизняних кіноринках прем\'єра відбудеться через кілька днів.',
        poster: 'https://s.4pda.to/4O5CIqjgswS1kFQJ4nrAgcV6wz0ysMLBWqMdF.jpg',
        like: false,
        comment: []
    },
    {
        id: 37,
        view: false,
        title: 'БУДЕ ЗНЯТО РЕМЕЙК «Повставшого з пекла»',
        text: 'Компанія Spyglass має намір приступити до перезапуску колись популярної франшизи «Повсталий з пекла», над якою працював Клайв Баркер. За повідомленнями західних ЗМІ, Девід С. Гойер стане продюсером і сценаристом нової версії. За тридцять років існування франшизі вдалося породити десять повнометражних проектів, чимало графічних романів, а також стати базою для лінійки різних товарів. Оригінальна картина базувалася на новелі Баркера, оповідаючи про історію Френка, якому вдалося за допомогою старовиною головоломки відкрити шлях в інший вимір. Так він стикається з моторошними істотами і пекла сенобітов, що доставляють садомазохистские задоволення людям, що закликає їх. Найвідомішим з них став Пінхед. Через роки Ларрі, який є братом Френка, перебирається в його занедбаний будинок з дружиною Джела. Випадково героям вдається повернути родича «з того світу», що веде до низки жахливих подій. Оригінальна картина 1987 років випуску виявилася одним з найпопулярніших проектів в жанрі хоррор. Поки не названі терміни роботи над новою кінострічкою.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133405_slide_0.jpg',
        like: false,
        comment: []
    },

    {
        id: 38,
        view: false,
        title: 'КОМПАНІЯ WALT DISNEY НА РІК перенесли ПРЕМ\'ЄРУ «АВАТАРА 2»',
        text: 'Студія Walt Disney вирішила відкласти прем\'єру проекту «Аватар 2». Нагадуємо, що мова йде про сиквел самого касового на сьогоднішній день фільму в історії кіно. Офіційний прес-реліз говорить, що кінострічка буде представлена на великих екранах в грудні 2021 року, в не в кінці наступного року, як заявлялося раніше. Поки немає інформації щодо причин зміни прокатного графіка. Безумовно, будуть перенесені і дати виходу інших картин серії - всі вони змістяться на рік. Відповідно «Аватар 3» вийде 15 грудня 2023 року четверта частина - в грудні 2025 року, а п\'ята частина - в грудні 2027 року. Варто зауважити, що раніше вже неодноразово переносилася дата прем\'єри фільму. Тоді ситуація пояснювалася трудомісткістю зйомок, які потребують застосування унікальних технологій, які створювалися спеціально для франшизи. Подробиці нових серій поки не розголошуються. Передбачається, що продовження буде показано як в стереоскопічному форматі, так і з підвищеною частотою кадрів. «Аватар» був представлений в прокаті в 2009 році, заробивши близько 2,7 мільярдів доларів. Події розгорнулися на планеті Пандора, аборигени якої не бажали бачити на своїх територіях земних колонізаторів. За сюжетом колишній морський піхотинець Джейк Саллі, якого відправили на розвідку в тілі аватара, раптово вирішує перейти на сторону мешканців Пандори.' ,
        poster: 'http://img.rosbalt.ru/photobank/4/c/e/8/YVdwFMGC-580.jpg',
        like: false,
        comment: []
    },

    {
        id: 39,
        view: false,
        title: 'КОЛІН ФЕРТ ОТРИМАВ РОЛЬ ШПИГУНА',
        text: 'Відомий британський актор Колін Ферт планує взяти на себе одну з ключових ролей у військовій кінострічці під назвою «Operation Mincemeat». Над фільмом намір попрацювати Джон Медден, раніше створював «Закоханого Шекспіра». Події кінострічки розгортатимуться в 1943 році. За сюжетом фільму союзники планують почати радикальне наступ на «Фортеця Європа». У центрі дії два досвідчених офіцера розвідки - Чарльз Чолмонделі і Юен Монтегю (Ферт), які вирішили здійснити неймовірний план дезінформації. «Історію операції під кодовою назвою« Фарш »можна назвати досить химерної і унікальною. Очікується кінематографічна суміш геніальної фантастики зі шпигунством найвищого рівня. Ставки будуть дійсно високими », - заявляє режисер. Поки немає точної інформації про знімальний і прокатному графіку. Зауважимо, що в минулому році шанувальники Коліна Ферта могли бачити його відразу в декількох кінострічках, в числі яких драматичний проект «Курськ» і казка «Мері Поппінс повертається». Актор є володарем багатьох престижних кінематографічних нагород, в числі яких і премії Американської Кіноакадемії.' ,
        poster: 'https://www.infox.ru/photo/946/72c/94672c06648a56f8b891f5c2553f7885asdasdasd5a59098706dae7.25633907-650x433-94672c06648a56f8b891f5c2553f7885.jpg',
        like: false,
        comment: []
    },

    {
        id: 40,
        view: false,
        title: 'Чедвік Боузман ЗІГРАЄ першою чорношкірою САМУРАЯ',
        text: 'Чедвік Боузман, є зіркою кіновсесвіту Marvel, має намір взяти участь в зйомках історичної драми «Ясуко», яка присвячується першого темношкірого самурая. За заявами західних ЗМІ, над сценарієм до кінострічки працює Даг Міро, раніше доклав руку до «нарком». Сам актор відзначає: «Легенда про Ясуко - один з найцікавіших історичних секретів. Адже мова йде про єдиний людину, який не належав до азіатського походження, але при цьому зумів стати самураєм. Мова йде не просто про бойовику. Це справжнє культурна подія, і я радий опинитися його частиною ». Історичні хроніки свідчать, що чорношкірий раб потрапив на територію Японії в кінці XVI століття в свиті високопоставленого єзуїта з Італії. Серед мешканців острівної держави, ніколи раніше не бачили африканців, стрімко почали розростатися чутки про якийсь «демона». В результаті вони дійшли до Оди Набунага, який править країною. Того вразили фізичні дані раба - його зріст становив вражаючі для японців 188 см. Правитель попросив залишити хлопця в Японії. У майбутньому його почали навчати військовому мистецтву. Набунага справив його в самураї. Африканець взяв участь у безлічі битв, наводячи жах на суперників. Поки немає інформації про терміни реалізації фільму.' ,
        poster: 'https://filmix.co/uploads/sliderPics/post_133454_slide_0.jpg',
        like: false,
        comment: []
    },

    {
        id: 41,
        view: false,
        title: 'Роланд Еммеріх ГОТУЄТЬСЯ ДО «Падіння МІСЯЦЯ»',
        text: 'Знаменитий німецький постановник Роланд Еммеріх має намір зняти фантастичну картину-катастрофу, яка дістала назву «Падіння Місяця». За повідомленнями західної преси, сюжетна лінія буде фокусуватися на «компанії невдах», яка має намір врятувати планету від неминучої катастрофи, через те, що Місяць зійшла з орбіти і почала рух до Землі. В офіційному описі заявляється, що герої зіткнуться з «незбагненною і невідомою силою, яка кидає виклик усьому, що нам відомо про Місяць, Землі і собі». Над сценарієм працював сам Еммеріх. На виробництво бюджету планується витратити близько 150 мільйонів доларів. Робота над фільмом, імовірно буде розпочато на початку 2020 року. Поки картина не встигла знайти підтримку з боку великої компанії. Раніше нею мала намір зайнятися Universal, але в підсумку відмовилася від цих задумів. Нагадуємо, що в нинішньому році буде представлений інший проект режисера - «Битва за Мідуей».' ,
        poster: 'https://filmix.co/uploads/sliderPics/post_133455_slide_0.jpg',
        like: false,
        comment: []
    },

    {
        id: 42,
        view: false,
        title: 'ПІШОВ З ЖИТТЯ ЄВГЕН Крилатов',
        text: 'На 86-му році в життя в Москві пішов з життя народний артист Росії і композитор Євген Крилатов. Багатьом глядачам він був відомий, як автор музики до проектів «Простоквашино», «Пригоди Електроніка», «Чародії», «Гостя з майбутнього» і іншим. Дочка знаменитості, Марія Крилатова, повідомила ТАСС, що композитор вшив з життя через двосторонньої пневмонії. Відзначимо, що Крилатов народився в 1934 році в Лисьві (Пермський край). Переїхавши в Мотовіліхе, став учнем місцевої музичної школи. Закінчивши її, вступив в Пермське музичне училище. Згодом навчався в Московській консерваторії на двох факультетах - по класу фортепіано і твори. Завершивши навчання в консерваторії, почав активно працювати в драматичному театрі. Його твори нерідко ставили в радіо-ефіри. Писав музику до таких знаменитим постановок, як «Лихо з розуму», «Ромео і Джульєтта» та іншим. Близько п\'ятдесяти років тому популярність композитору принесла робота над мультиками «Умка», «Дід Мороз і літо». Згодом регулярно працював з радянськими кінематографістами, створивши музику до безлічі проектів.' ,
        poster: 'https://filmix.co/uploads/sliderPics/post_133478_slide_0.jpg',
        like: false,
        comment: []
    },

    {
        id: 43,
        view: false,
        title: 'СТАЛО ВІДОМО, ЧОМУ з четвертої «Месники» вирізали Кетрін Ленгфорд',
        text: 'Восени минулого року заявлялося, що Кетрін Ленгфорд, яка грає в серіалі «13 причин чому», долучилася до акторської команди картини «Месники 4: Фінал». Фанати довго намагалися з\'ясувати, кого зіграє актриса, але в підсумку зовсім не побачили її у фільмі. Режисери проекту підтверджують, що Ленгфорд насправді знімалася в картині, але її сцену вирізали. Зокрема Джо Руссо заявив, що Ленгфорд належало з\'явитися в ролі подорослішала дочки Старка, Морган. У початковій версії, взявши каміння нескінченності і розібравшись з Таносом і його армією, Тоні опинявся в потойбічному світі, в якому в «Війні нескінченності» Таноса чекала маленька Гамора. Тоні замість цього треба було зустріти дорослу дочку. «Ми думали, що Тоні виявиться в метафізичному перевалочному пункті, куди потрапив і Танос при натисканні пальцями. Там на нього чекала версія подорослішала дочки. Сцена була показана на тест-переглядах, але глядачі лише заплуталися », - говорить Джо Руссо. Ентоні Руссо додає: «У нас не виникло відчуття його емоційного зв\'язку з дорослою Морган. Це не спрацювало, тому ми виключили сцену ». Джо Руссо резюмує: «Дочка з майбутнього прощала його і відпускала. Це непогана ідея, але вона стала зайвою в такій складній кінострічці ».' ,
        poster: 'https://filmix.co/uploads/sliderPics/post_133479_slide_0.jpg',
        like: false,
        comment: []
    },

    {
        id: 44,
        view: false,
        title: 'ДЖОРДЖ Р. Р. МАРТИН ПІДТВЕРДЖУЄ РОБОТУ НАД СПИН-ОФФАМИ «Гри престолів»',
        text: 'Джордж Р. Р. Мартін в своєму персональному блозі заявив, що НВО, як і раніше працюють над трьома спін-оффамі «Ігри престолів». Крім вже згаданої в пресі «Довгої ночі», будуть серіали, сюжет яких сфокусується на минулому Таргаріенов. «Старт зйомок« Довгої ночі »пройде вже в нинішньому році. Два інших проекту на стадії розробки сценарію. Щоб дізнатися про них більше, купіть «Полум\'я і кров» », - зазначає письменник. Події цієї книги відбуваються за три сотні років до дії «Ігри престолів». Сюжет фокусується на будинку Таргаріенов, які змушені залишити Валіра. До слова, розповідь ведеться від імені Мейстера Гільдейна. Два роки тому заявлялося, що НВО працює на декількома спін-оффамі до популярного серіалу. Поки замовлення на виробництво пілота отримав лише проект «Довга ніч». Йдеться про приквелі, що розповідає про події Вестерос, що відбулися задовго до історії «Ігри престолів». Про інші спін-оффи інформації практично немає. Ходять чутки, що в одному з них розкажуть про Валірійской імперії - від її світанку до краху. Відсутність даних інших спін-оффах змусили шанувальників «Ігри престолів» думати, що НВО вирішив відмовитися від початкових задумів, але, судячи з усього, це не так.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133480_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 45,
        view: false,
        title: 'ДЖЕЙМС КЕМЕРОН ПРИВІТАВ «Месники 4»',
        text: 'Відомий режисер Голлівуду, Джеймс Кемерон, вирішив привітати колег з Marvel з успіхом четвертої частини «Месників» і її перемогою над проектом «Титанік». Думками з цього приводу кінематографіст поділився в одній із соціальних мереж. «Кевіну і його партнерам. Колись «Титанік» був потоплений айсбергом. Тепер мій «Титанік» потоплений Месниками. Я і мої колеги вітаємо це вагоме досягнення. Ви показали, що кіноіндустрія жива і навіть могутніше, ніж раніше », - зазначив режисер. Зауважимо, що екранізація братів Руссо заробила в світовому прокаті понад 2,2 мільярда доларів, обійшовши за касовими зборами всі проекти, окрім «Аватара», який теж знімав Кемерон. Четверта честь «Месників» відзначилася великою кількістю рекордів, і, напевно, її чекають і інші досягнення. Провідні ролі грали: Кріс Еванс, Кріс Хемсворт, Джеремі Реннер, Пол Радд, Роберт Дауні мл. та інші знамениті актори. Режисерами проекту стали Ентоні і Джо Руссо.',
        poster: 'https://24smi.org/public/media/2017/9/12/main.jpg',
        like: false,
        comment: []
    },


    {
        id: 46,
        view: false,
        title: 'СЕСТРИ Вачовскі ВЗЯЛИСЯ ЗА ПРОДОВЖЕННЯ «МАТРИЦІ»',
        text: 'Цілком ймовірно, що відома трилогія «Матриця» матиме продовженням. У недавній розмові з журналістами, автор картини «Джон Вік 3» Чад Стахелскі заявив, що сестри Вачовскі вирішили почати роботу над четвертою кінострічкою. «Шалено радий те, що Вачовскі не просто створили« Матрицю », а й почали розширювати те, що нам всім так подобалося. Якщо це наблизиться за рівнем до того, що вони робили раніше, то нехай дзвонять мені в будь-який час! Я готовий буду виконувати в цьому фільмі трюки, навіть під машину стрибну заради цього », - каже постановник. Поки він не уточнив, чи йде мова про пряме продовження проекту, або це все-таки перезавантаження. Також кінематографіст не має інформації про те, чи планують Вачовскі виступити режисерами фільму. Як би там не було, але Стахелскі кілька разів підкреслив, що заради продовження «Матриці» готовий все кинути в будь-яку секунду, і відправитися на допомогу. Нагадуємо, що проект «Матриця 3: Революція» вийшов на екрани в 2003 році. Глядачам було представлено відкритий фінал, натякає на те, що історія продовжитися. Ключову роль в знаменитій кінострічці взяв на себе Кіану Рівз.' ,
        poster: 'https://filmix.co/uploads/sliderPics/post_133499_slide_0.jpg',
        like: false,
        comment: []
    },


    {
        id: 47,
        view: false,
        title: 'Терон здалась образливою ПРОПОЗИЦІЯ ЗІГРАТИ В «ЧУДО-ЖІНЦІ»',
        text: 'Відома актриса Голлівуду Шарліз Терон в одному з шоу підтвердила, що їй надійшла пропозиція зіграти в «Чудо жінці». Актриса зазначила, що відкинула цю пропозицію, вважаючи його «ляпасом». «Я не відмовлялася зображати Чудо-жінку. Взагалі, ця історія стала ілюстрацією того, як Голлівуд відважує ляпаси старіючим актрисам. Мені заявили, що вся роль буде дуже динамічною. Я навіть не відразу зрозуміла, що мені пропонують зовсім не образ Чудо-жінки. Мені було сказано: «Ти, напевно, неправильно зрозуміла, ми пропонуємо роль матері головної героїні». Ось так »- згадує знаменитість. Зауважимо, що Галь Гадот, якої в підсумку дісталася роль, всього на дев\'ять років молодший за зірки «Монстра». Роль матері знаменитої амазонки в результаті грала Конні Нільсен. Прем\'єра «Чудо-жінки» відбулася в 2017 році. Фільм заробив в світовому прокаті близько 820 мільйонів доларів. У наступному році вийде друга частина екранізації. Ключові ролі в ній грають: Галь Гадот, Педро Паскаль, Рави Патель, Габріелла Уайлд, Лінда Картер.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133500_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 48,
        view: false,
        title: 'Кіану Рівз ПОДІЛИВСЯ захоплення ДЖОНА ВІКа',
        text: 'Як виявилося, знаменитий кілер з проекту «Джон Вік» має досить незвичайне хобі. Саме таку заяву в недавньому інтерв\'ю зробив виконавець провідну роль, Кіану Рівз. Актор зазначив, що найманий вбивця, у вільний від робочих турбот час реставрує старі книги. «Перший варіант сценарію містив інформацію про те, що Джон захоплений відновленням книг і старими шкіряними палітурками. Нами була знята відповідна сцена, але вона не потрапила в кінострічку. У нього достатньо часу для хобі. Можливо, це навіть було його справжнім визнанням », - зазначив актор. До слова в трейлері кінострічки «Джон Вік 3» присутній сцена, в якій ключовою герой завдає ворогові удар важкою книгою. Не виключено, що епізод якось пов\'язаний з хобі УІКа. Нагадуємо, що прем\'єра фільму відбудеться вже в найближчі дні. Крім Рівза в зйомках картини взяли участь такі актори, як Лоуренс Фішберн, Робін Тейлор, Холлі Беррі, Йен МакШейн, Анджеліка Х\'юстон, Ленс Реддік, Хіроюкі Санада, Азія Діллон і інші.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133507_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 49,
        view: false,
        title: 'СЕРІАЛ «СМЕРТЕЛЬНЕ ЗБРОЯ» ЗАВЕРШИТЬСЯ третьому сезоні',
        text: 'Телевізійний канал Fox вирішив покінчити з черговим проектом. На цей раз мова йде про серіал «Смертельна зброя». Прес-реліз говорить, що шоу закриється після того, як буде представлений третій сезон. Нагадуємо, що в основі проекту лежали повнометражні картини, провідні ролі в яких були закріплені за такими знаменитими акторами, як Мел Гібсон і Денні Гловер. Перший сезон шоу відзначився хорошими результатами і продемонстрував багатообіцяючі глядацькі рейтинги. Згодом серіал залишили виконавці головних ролей, і їх заміна не принесла позитивних результатів. У 2016 році проект навіть був претендентом на нагороду People\'s Choice Awards за результатами загальнонаціонального голосування в категорії «телебачення». Нагадуємо, що учасниками акторської команди стали: Клейн Кроуфорд, Чандлер Кінні, Деймон Уайанс, Джордана Брюстер, Шонн Вільям Скотт, Крістен Гутоскі, Рекс Лінн та інші. У 2017 році з\'ясувалося, що у повнометражної картини «Смертельна зброя» може з\'явитися п\'ята частина. Повідомлялося, що виконавці провідних ролей готові взяти участь в зйомках продовження. Втім, з тих пір інформація на цей рахунок не оновлювалася.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133509_slide_0.jpg',
        like: false,
        comment: []
    },
    {
        id: 50,
        view: false,
        title: 'ПЕРСПЕКТИВИ ДРУГИЙ ЧАСТИНИ «Годзілли»',
        text: 'Судячи з усього, старт кінострічки «Годзилла 2: Король монстрів» буде гірше, що старт першої частини. На це вказують попередні прогнози, якими поділилося видання The Hollywood Reporter. Передбачається, що касові збори фільму в перший уїк-енд складуть приблизно 50 мільйонів доларів. Нагадуємо, що перша частина вийшла на великі екрани п\'ять років тому, зібравши на старті приблизно 93 мільйони доларів. У свою чергу картина «Конг Острів черепа» заробив 61 мільйон доларів в перші дні прокату. Збори «Годзілли 2» можуть бути гірше через декількох факторів, включаючи сусідство в прокаті з проектом «Аладдін», орієнтованим приблизно на ту ж публіку. Провідні ролі у кінострічці взяли на себе Віра Фарміга, Міллі Боббі Браун, Бредлі Уітфорд, Аїша Хіндс, Кайл Чандлер, Саллі Хокінс, Цзиі Чжан, Чарльз Денс і інші актори. Режисером другої частини став Майкл Догерті. Деякий час назад постановник заявляв, що хотів би побачити на екранах кросовер, в якому б знаменитий монстр зустрівся з Месниками Marvel. Зауважимо, що такий сюжет вже був реалізований в коміксах 70-х років.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133510_slide_0.jpg',
        like: false,
        comment: []
    },

    {
        id: 51,
        view: false,
        title: 'ЧОРНА ВДОВА МОГЛА БУТИ ГОЛОВОЮ сиротинця',
        text: 'У кінострічці «Месники 4: Фінал» у Чорної вдови були всі шанси здобути не те заняття, яке їй в підсумку придумали сценаристи після «клацання Таноса». За словами режисера проекту, Джо Руссо, в перших варіантів сценарію передбачалося, що Наташа стане главою центру, який надає підтримку осиротілим дітям. Також режисер зазначає, що автори екранізації грунтувалися на припущенні, що багатьом дітям довелося залишитися без батьків. «В одну мить з\'явилася велика кількість сиріт. Неймовірна кількість. Перебуваючи на ранньому етапі розвитку фільму, у мене було припущення, що було б непогано, якби Чорна Вдова стала главою подібної установи у Вашингтоні. Я думав, що вона могла б займатися саме цим через п\'ять років », - каже Руссо. Втім, він вирішив не уточнювати, чому в підсумку ця концепція була відкинута творцями проекту. Зауважимо, що роль Чорної Вдови кілька років грала Скарлетт Йоханссон. Незабаром очікується вихід сольного проекту про популярну героїні. Нагадуємо, що на сьогоднішній день «Месників 4» вдалося зібрати значну касу - 2,5 мільярда доларів. Цілком ймовірно, що незабаром картина виявиться найуспішнішим фільмом в історії кіно, обійшовши «Аватара».',
        poster: 'https://filmix.co/uploads/sliderPics/post_133538_slide_0.jpg',
        like: false,
        comment: []
    },

    {
        id: 52,
        view: false,
        title: 'Озвучино прогноз про дохід ПРОЕКТУ «ЛЮДИНА-ПАВУК: далеко від дому»',
        text: 'Озвучені ранні прогнози по стартовим заробітків картини «Людина-павук: Далеко від дому» на батьківщині. На думку порталу, проекту вдасться за перші вихідні заробити близько 90-120 мільйонів доларів. Це дозволить сиквелу стартувати на рівні першої картини, колись яка заробила близько в Північній Америці 117 мільйонів доларів за прем\'єрний уїк-енд. Звичайно ж, ближче до прем\'єри, прогнози, ймовірно, будуть змінені в бік збільшення. Додатковим факторами називають успіх третьої і четвертої частин «Месників», в яких Людині-павуку відводилася важлива роль. Крім цього не можна ігнорувати і присутність в проекті відомих героїв з кінематографічної всесвіту Marvel. Експерти також вказують на успіх раніше випущених трейлерів проекту і значну кількість коментарів в соціальних мережах, що відносяться до самої картини і її ключового персонажа. Зауважимо, що другий трейлер вважається найбільш проглядаються в історії компанії Sony Pictures. Учасниками акторської команди проекту стали Том Холленд, Кобі Смалдерс, Зенден, Семюел Л. Джексон, Джейк Джилленхол, Лаура Херріер, Маріса Томей іпрочіе актори. Прем\'єри фільму відбудеться вже наступного літа.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133540_slide_0.jpg',
        like: false,
        comment: []
    },

    {
        id: 53,
        view: false,
        title: 'МАЙКЛ ШЕННОН ОТРИМАВ РОЛЬ ТРЕНЕРА',
        text: 'Майкл Шеннон намір попрацювати над спортивною драмою «Swing», режисером якої виступить Ховард Дойч, який раніше знімав «Дублерів». Сюжет фільму буде побічно відсилати до таких хітам, як «Вогні нічної п\'ятниці» і «Товариство мертвих поетів». Події розгортаються в 1999 році. Університетській команді, що займається спортивною веслуванням, доводиться переживати не найкращі часи: до закінчення коледжу залишається зовсім мало часу, але хлопцям так і не вдається пізнати справжній успіх. Ситуація починає змінюватися, коли приходить новий тренер, раніше брав участь у В\'єтнамської війні. Ветерану вдається докорінно змінити ставлення студентів до спорту. «Майкл - приголомшливий актор. Разом з режисерським талантом Ховарда, картина змусить глядачів з інтересом спостерігати за розгортаються подіями », - переконаний продюсер проекту. Знімальний процес стартує через три місяці. Над сценарієм працює Войін Гжажа. До слова, сам Шеннон недавно взяв участь в зйомках серіалу «Маленька барабанщица». Також незабаром очікується прем\'єра трилера «Ножі наголо», в якому він зіграв одну з ролей.',
        poster: 'https://filmix.co/uploads/sliderPics/post_133541_slide_0.jpg',
        like: false,
        comment: []
    }

];
films: Film[] = [
    {
        name: 'Втеча з Шоушенка',
        poster: 'https://st.kp.yandex.net/images/film_iphone/iphone360_326.jpg',
        date: 1994,
        description: `Вирок суду виявився суворішим, і він отримав два довічні терміни, які йому належить відбувати в найпохмурішою американській в\'язниці - в Шоушенка. Зйомки фільму "Втеча з Шоушенка", який хочеться дивитися онлайн, проходили в Менсфілдской виправній колонії в штаті Огайо. Частина  бюджетних грошей була витрачена на реставрацію будівель, так як колонія знаходилася в поганому стані.Но Енді, незважаючи на весь жах того, що відбувається, намагається думати про майбутнє. Він допомагає ув^язненим отримувати освіту, охоронцям допомагає заповнювати податкові декларації, начальству в*язниці допомагає з фінансовими махінаціями і починає дружити зі злочинцем афроамериканського походження Редом. Тільки йому він довірив таємницю про втечу, який планує здійснити з самого початку, як опинився у в^язниці. За плакатом, який висить у нього в камері на стіні, знаходиться дірка, яку він протягом багатьох років готував за допомогою того, що знаходилося під руками.`,
        rating: 9.3,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/The.Shawshank.Redemption.1994.BDRip.1080p_480.mp4',
        actors: 'Тім Роббінс, Морган Фріман, Боб Гантон, Увільям Седлер, Кленсі Браун',
        director: 'Френк Дарабонт',
        category: 'драма',
        id: 1,
        like: false,
        views: 520,
        view: false,
        comment: []
    },
    {
        name: 'Хресний батько',
        poster: 'http://static.hdrezka.ac/i/2014/3/4/i079d37789b07yj22h46l.jpg',
        date: 1972,
        description: 'Події фільму «Хрещений батько» починають розгортатися влітку 1945 року, коли Віто Корлеоне організовує святковий прийом на честь одруження своєї рідної дочки Конні і її чоловіка Карло Рицци. дон Віто - лідер впливового злочинного клану Корлеоне і особистий юрист сім^ї Том Хеген вислуховують  прохання від близьких друзів сім^ї, партнерів і приймають поздоровлення. А в цей же час молодший син Віто розповідає своїй подружці різні історії про те, чим займається його батько і наближені до нього люди, запевняючи її, що цим займається лише сім^я, але ніяк не він сам. Сімейство Корлеоне за багато років активної діяльності вдалося монополізувати зв^язку, здатні забезпечити повне політичне і судове прикриття впливовим сіцілійським кланам. Щороку дон Віто стає все багатшими і впливовішими, ніж влаштовує далеко не всіх. Деякі злочинні клани, не бажаючи такого розвитку подій, починають розробку холоднокровного і продуманого плану по настанню на сім^ю Корлеоне. Вони впевнені, що зможуть придушити Віто, але не знають, до яких наслідків це призведе.',
        rating: 9.2,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/The.Godfather.1972.BDRip.1080p_480.mp4',
        actors: 'Марлон Брандо, Аль Пачіно, Джеймс Каан, Роберт Дювалл, Річард С. Кастеллано',
        director: 'Френсіс Форд Коппола',
        category: 'драма, кримінал',
        id: 2,
        like: false,
        views: 320,
        view: false,
        comment: []
    },
    {
        name: 'Зелена миля',
        poster: 'http://images.amazon.com/images/P/B00003CWQU.01.LZZZZZZZ.jpg',
        date: 1999,
        description: 'Історія у фільмі «Зелена Миля» викладається у формі розповіді одного з мешканців будинку для людей похилого віку. Він розповідає своїй знайомій про те, як в молодості працював у в^язниці. Події переносять глядача в 1935 рік. Пол влаштовується на роботу наглядачем у в^язницю і потрапляє в блок, де утримуються ув^язнені, які перебувають в очікуванні виконання смертної кари. Пол всього коридору забарвлений в зелений колір, тому багато хто називає його «Зеленої милею». Серед інших наглядачів в цьому ж блоці працює боягузливий, агресивний і підлий хлопець Персі, постійно знущаються над ув^язненими через упевненість в своїй вседозволеності. Втомившись від його постійних витівок, головний герой фільму «Зелена Миля», перегляд якого можна здійснити на нашому сайті в режимі онлайн, укладають з ним договір, за умовами якого йому буде дозволено керувати однією з страт, після чого він переведеться в іншу установу. Одночасно з цим в тюрму надходять Вільям і Джон.',
        rating: 8.6,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/The.Green.Mile.1999.BDRip.1080p.rus_480.mp4',
        actors: 'Том Хенкс, Девід Морс, Бонні Хант, Майкл Кларк Данкен, Джеймс Кромуелл',
        director: 'Фрэнк Дарабонт',
        category: 'драма, кримінал,  детектив',
        id: 3,
        like: false,
        views: 420,
        view: false,
        comment: []
    },
    {
        name: 'Форрест Гамп',
        poster: 'https://s.057.ua/section/afisha_event/upload/pers/16/img/afisha/000/000/101/x6y2rx4shjgbx26_5b269705b1d39.jpg',
        date: 1994,
        description: 'Будучи дев^ятим за рахунком повнометражним фільмом Роберта Земекіса, фільм «Форрест Гамп», поставлений за однойменним романом, став одним з найуспішніших фільмів в кар^єрі режисера. «Форрест Гамп» був позитивно відзначено не тільки простими глядачами, що призвело до комерційного успіху, а й багатьма критиками. Крім того, картина була відзначена безліччю кінопремій. 1981 рік. Головний герой, сидячи на лавці, розповідає історію свого життя всім тим людям, які сідають поруч з ним. Починається його розповідь з подій, які сталися з ним в дитинстві. Після цього глядачеві, залученому в перегляд фільму, пропонують подивитися на ті події, які відбувалися з ним під час навчання в університеті і на війні у В^єтнамі. Нам дають можливість поспостерігати за його успіхами в області спорту і комерції. За 142 хвилини хронометражу нам пропонується прожити разом з Форрестом Гампом його екранне життя, спостерігаючи за його злетами, падіннями, стараннями і подіями, які роблять його життя такої незвичайної і дивовижною.',
        rating: 8.8,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd_4k/Forrest.Gump.1994.2160p_480.mp4',
        actors: 'Том Хенкс, Робін Райт, Гері Сініз, Майкелті Увільямсон, Саллі Філд',
        director: 'Роберт Земекіс',
        category: 'драма, мелодрама',
        id: 4,
        like: false,
        views: 820,
        view: false,
        comment: []
    },
    {
        name: 'Список Шиндлера',
        poster: 'http://static.hdrezka.ac/i/2013/12/6/zd465feb67bb0wa38m43l.jpg',
        date: 1993,
        description: 'В основі картини лежить роман «Ковчег Шиндлера», написаний Томасом Кеніллі. Вона була знята американським режисером Стівеном Спілбергом в 1993 році. Картина, як і книга, засновані на історії життя реального бізнесмена з Німеччини Оскара Шиндлера. Під час війни йому вдалося влаштувати на свою фабрику більше тисячі польських євреїв, які могли стати в^язнями таборів смерті.Собитія відбуваються в нацистській Німеччині в 1939 році. Відбувається реєстрація всіх євреїв, щоб надалі переселити їх в окреме гетто. Німецький підприємець приїздить до Кракова для відкриття в цьому місті фабрики, що виробляє емальовані вироби. Шиндлер легко знаходить спільну мову з членами СС і людьми, які обіймають високі посади в армії Німеччини.',
        rating: 8.9,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/Schindlers.List.1993.BDRip.1080p_480.mp4',
        actors: 'Ліам Нісон, Бен Кінгслі, Райф Файнс, Керолайн Гудолл, Эмбет Дэвідц',
        director: 'Стівен Спілберг',
        category: 'драма, біографія, історія',
        id: 5,
        like: false,
        views: 720,
        view: false,
        comment: []
    },
    {
        name: 'Хресний батько 2',
        poster: 'http://static.hdrezka.ac/i/2014/3/4/fb69ca1870a99rz93p68w.jpg',
        date: 1974,
        description: 'І тепер уже, будучи, хрещеним батьком, він вирішує справи сім^ї. Гральний бізнес Корлеоне під загрозою через місцевого сенатора Пета Гирі, який шантажує Майкла. Однак того вдається перехопити ініціативу, і він захищає свою справу. Майкл піддається замаху, в результаті якого ледь не постраждала його дружина Кей. Вона вже не вірить, що її чоловік може займатися чимось легальним і законним.Майкл розуміє, що в їх клані є зрадник і вирішує відійти на час від справ, виїхавши в Майамі. Там він і літній єврейський мафіозі Хайман Рот починають вкладати інвестиції в готельний бізнес Гавани. Самому Роту хочеться при першій же можливості зробити так, щоб Майкла не було в грі. Молодому дону стає зрозуміло, що він повинен першим завдати удару.',
        rating: 9.0,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/The.Godfather.Part.II.1974.BDRip.1080p_480.mp4',
        actors: 'Аль Пачіно, Роберт Де Ніро, Дайан Кітон, Роберт Дювалл, Джон Казале',
        director: 'Френсіс Форд Коппола',
        category: 'драма, кримінал',
        id: 6,
        like: false,
        views: 440,
        view: false,
        comment: []
    },
    {
        name: 'Темний лицар',
        poster: 'https://upload.wikimedia.org/wikipedia/uk/thumb/8/8a/Dark_Knight.jpg/220px-Dark_Knight.jpg',
        date: 2008,
        description: 'Фільм Кріса Нолана «Темний лицар», незважаючи ні на такий вже давній «вік», вже міцно завоював собі місце в рядах кінокласики. Знову Готем, знову Бетмен ... Здавалося б, попередні частини франшизи були зняті настільки невдало, що тільки диво могло допомогти Крістоферу Нолану зацікавити глядача сагою про продовження наведення порядку в місті похмурих хмарочосів і ще більш похмурих справ. І чуже допомогли зробити сценаристи і Хіт Леджер, який грає «Джокера». Його Джокер став непростим антагоністом Бетмена, як раніше, немає, Джокер Леджера хоче не просто перемогти «лицаря Готема», а й розбити його філософію: «героїв-одинаків, гордих лицарів добра не буває і бути не може!», Прозирає в кожній репліці, в кожному діянні Джокера. Тож не дивно, що серед зібраних «Темним лицарем» «Оскарів», золота статуетка за кращу чоловічу роль дісталася не Крістіану Бейлу, а саме Хіту Леджеру. Це перший антагоніст Бетмена, здатний викликати часткові симпатії глядача - дивіться «Темного лицаря» онлайн, хіба вам не сподобається, що Джокер в цій картині грабує банки корумпованою міської еліти? Так само ви побачите в «Темному лицарі» - чи не вперше в сазі про Бетмана, як головний герой виявляється на межі поразки: безжурний супермен ледь не ламається морально, задумавшись на тему «чи є сенс боротися далі». Обов^язково дивіться «Темного лицаря», - крім приголомшливо похмурої і атмосферної «картинки» і блискучої гри акторів (особливо Гері Олдмена в ролі Гордона, лейтенанта кримінальної поліції і Меггі Джілленхолл в ролі Рейчел), крім масштабних сцен руйнування (сцена з поромами підійшла б для будь-якого фільму-катастрофи), «Темний лицар» ще й найрозумніше кіно з всі франшизи!',
        rating: 9.0,
        locate: 'США, Британія',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd_4k/The.Dark.Knight.2008.UHDVCRip_480.mp4',
        actors: 'Крістіан Бейл, Хіт Леджер, Аарон Екхарт, Меггі Джілленхол, Гарі Олдман',
        director: 'Крістофер Нолан',
        category: 'фантастика, триллер, бойовик, драма, кримінал',
        id: 7,
        like: false,
        views: 920,
        view: false,
        comment: []
    },
    {
        name: 'Кримінальне чтиво',
        poster: 'https://st.kp.yandex.net/images/film_iphone/iphone360_342.jpg',
        date: 1994,
        description: 'У першій з них Вінсент доглядає за дружиною Марселласа Мией і рятує її від передозування наркотиків. У другій розповідається про Бутч Кулідж, боксера, найнятому Уоллесом, щоб здати бій, але обдурили його. Третя історія об^єднує перші дві - в кафе парочка молодих невдачливих грабіжників - Пампкин і Хані Бані роблять спробу пограбування, але Джулс зупиняє їх.',
        rating: 8.9,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/Pulp.Fiction.1994.BDRip.1080p_480.mp4',
        actors: 'Джон Траволта, Семюел Л. Джексон, Брюс Вілліс, Ума Турман, Вінг Реймз, Тім Рот, Харві Кейтель, Квентін Тарантіно',
        director: 'Квентін Тарантіно',
        category: 'триллер, комедія, кримінал',
        id: 8,
        like: false,
        views: 1000,
        view: false,
        comment: []
    },
    {
        name: 'Хороший, поганий, злий',
        poster: 'https://ua-tv.net/thumb.php?src=https://ua-tv.net/uploads/posts/2017-12/ua-tv.net_horoshiy-poganiy-zliy_1.jpg&w=200&h=281&zc=1',
        date: 1966,
        description: 'У самий розпал громадянської війни в шт. Нью-Мексико була зупинена маленька війна. Троє самотніх чоловіків, озброєні по повній мірі, вирішують пуститися в дорогу, щоб відшукати вкрадене золото. Кожен з чоловіків кваліфікується своїм способом роботи і володіє незвичайною репутацією. «Поганим» представляється нещадний вбивця сентенції. Він стурбований ідеєю відшукати вкрадене золото у Конфедерації. Після довгих пошуків він знаходить інформацію, яка може привести його до довгоочікуваного "призу" і він зможе забрати його собі. Але для того, щоб воно дісталося йому повністю, тепер сентенції необхідно позбутися від тих, хто ще претендує на скарб. Але це практично нереально, адже про золото знають ще двоє шахраїв: «Хороший» і «Злий». «Хорошим» звуть самотнього стрілка блондинчик, який власноруч вистежує бандитів і здає їх правосуддю за нагородження. А «Злий» - це Туко, він дуже часто перетинається з блондинчик, йому завжди виходить уникнути покарання. Коли всі троє починають шукати золото, Нью-Мексико перетворюється на справжній екстремальний місто.',
        rating: 8.9,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/The.Good.the.Bad.and.the.Ugly.1966.BDRip.1080p_480.mp4',
        actors: 'Клінт Іствуд, Лі Ван Кліф, Ілай Уоллак, Альдо Джуффре, Луіджи Пістиллі',
        director: 'Серджио Леоне',
        category: 'вестерн',
        id: 9,
        like: false,
        views: 720,
        view: false,
        comment: []
    },
    {
        name: 'Бійцівський клуб',
        poster: 'http://moviestape.net/uploads/posts/2010-04/1271963903_fight-club_poster.jpg',
        date: 1999,
        description: 'Одній людині сильно набридла його життям Молодий чоловік вже тривалий час страждає через відсутність нормального сну ночами. Часом герой навіть плутає, де реальність, а де сновидіння. Він намагається зробити все можливе, щоб назавжди позбутися від нудної і нудною життя. Головний герой кінострічки під назвою «Бійцівський клуб» одного разу зустрічає Тайлера Дарка, який ніколи нічого не робив для того, щоб поліпшити себе. Для чоловіка набагато простіше займатися повним руйнуванням власної особистості. Цьому він і присвятив останні роки життя. Герой фільму "Бійцівський клуб", подивитися який потрібно прямо зараз, Тайлер швидко знаходять спільну мову один з одним. Вони стають приятелями. За певних причин між чоловіками зав^язується бійка. Це заняття принесло обом одне лише задоволення.',
        rating: 8.8,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/Fight.Club.1999.BDRip.1080p_480.mp4',
        actors: 'Едвард Нортон, Бред Пітт, Хелена Бонем Картер, Міт Лоаф, Зек Гренье',
        director: 'Девід Фінчер',
        category: 'триллер, драма, кримінал',
        id: 10,
        like: false,
        views: 930,
        view: false,
        comment: []
    },
    {
        name: '1+1',
        poster: 'https://st.kp.yandex.net/images/film_iphone/iphone360_535341.jpg',
        date: 2011,
        description: 'На самому початку перегляду фільму «1 + 1» або «Недоторкані» глядач знайомиться з багатим, але паралізованим аристократом Філіпом, який став таким після того, як зазнав аварії на параплані. Саме з цієї причини він шукає собі відповідального помічника, який буде за ним доглядати.Іронія в тому, що одному з кандидатів, Дриссу, робота явно не потрібна - він всього лише хоче отримати письмову відмову для того, щоб надати офіційну документацію в державні органи для отримання допомоги по безробіттю. Але він і подумати не міг, що Філіп прийме його на роботу. Комічність полягає в тому, що сенегальського вихідцю з кримінальними нахилами, хороші манери невідомі - він безтактний, прямолінійний і грубий. Крім того, він геть позбавлений будь-якого роду умов. Але саме це в ньому і привертає Філіпа.',
        rating: 8.5,
        locate: 'Франція',
        url: 'https://vs2.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/Odin.plus.odin.2011.D.BDRip.1080p_480.mp4',
        actors: 'Франсуа Клюзе, Омар Сі, Анн Ле Ні, Одрі Флеро, Жозефін де Мо',
        director: 'Ерік Толедано',
        category: 'драма, комедія, біографія',
        id: 11,
        like: false,
        views: 900,
        view: false,
        comment: []
    },
    {
        name: 'Початок',
        poster: 'https://s4.vcdn.biz/static/f/1396166071/image.jpg/pt/r300x423',
        date: 2010,
        description: 'Крістофер Нолан остаточно утвердився в званні «метрів шедевра», створивши постановку «Начала» за власним сценарієм. Але, з одного боку, фільм являє собою класичний фентазійной сюжет, коли невловимий і безтурботно-безладний майстер-злодій Кобб повинен пройти суворий квест. З іншого боку - це сучасний трилер, так як Кобб (Леонардо ДіКапріо) з командою крадуть ідеї, займаючись «інтелектуальним шпигунством». З третього боку, кінокартина «Початок» - приголомшливий фантастичний трилер, адже мало того, що, за умовами нового «квесту», Кобб повинен не вкрасти, а «народити» (впровадити в світ) ідею, так ще й майстерня зйомка (постійний оператор Нолана Уоллі Пфіфстер) змусить гадати навіть самих проникливих глядачів, яка саме частина дії в кінострічці відбувається наяву, яка - у снах, коли Кобб «дозволяє» діяти за себе своєму вивільненому підсвідомості.',
        rating: 8.7,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd_4k/Inception.2010.UHDVCRip_480.mp4',
        actors: 'Леонардо ДіКапріо, Джозеф Гордон-Левітт, Еллен Пейдж, Том Харді, Кен Ватанабе, Маріон Котійфр',
        director: 'Крістофер Нолан',
        category: ' фантастика, драма, бойовик, кримінал',
        id: 12,
        like: false,
        views: 840,
        view: false,
        comment: []
    },
    {
        name: 'Леон',
        poster: 'https://st.kp.yandex.net/images/film_iphone/iphone360_389.jpg',
        date: 1994,
        description: 'Чоловік на ім^я Леон є одним з кращих найманих вбивць в тутешніх краях. Саме до цієї людини звертаються в тих випадках, коли терміново потрібно вирішити складну проблему. Головний герой кінокартини ніколи не знав, що значить любити когось або ж відчувати жалість. Часом може здаватися, що Леон взагалі не здатний що-небудь відчувати. Випадково головний герой познайомився з дівчиною на ім^я Матильда. Вона живе як раз по сусідству з кілером. У житті у дівчини сталася трагедія. Була вбита вся її сім^я. Матильда навіть знає, хто позбавив її щасливого дитинства. У смерті рідних людей героїня бачить співробітників поліції, які якимось чином були пов^язані з реалізацією заборонених речовин.',
        rating: 8.6,
        locate: 'Франція',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd_4k/Leon.The.Professional.1994.Theatrical_480.mp4',
        actors: 'Жан Рено, Гарі Олдман, Наталі Портман, Денні Айєлло, Майкл Бадалукко',
        director: 'Люк Бессон',
        category: 'триллер, драма, бойовик, кримінал',
        id: 13,
        like: false,
        views: 750,
        view: false,
        comment: []
    },
    {
        name: 'Політ над гніздом зозулі',
        poster: 'http://www.world-art.ru/cinema/img/10000/4898/20.jpg',
        date: 1975,
        description: 'Обравши шлях хворого, Макмерфі намагається налагодити відносини в клініці, але натикається на стіну нерозуміння. Рендл робить все, щоб розбудити почуття власної гідності у пацієнтів, повстає проти правил і дивується, чому, хоч і нездорові, але, все ж, чоловіки не повстануть проти втручання в їх особисте життя. Персонал присікає всі спроби Рендл олюднити відділення і він, всім на зло, збирає групу пацієнтів і збігає з ними на рибалку.В ході подій Макмерфі знайомиться з індіанцем на прізвисько Вождь і усвідомлює, що майже всі його нові знайомі знаходяться тут добровільно, ховаючись від навколишнього світу . В цей час медичний консиліум вирішують, що Рендл симулює хворобу і повинен відправитися назад у в^язницю, але сестра Мілдрет розраховує на дивного пацієнта, тому наполягає на продовженні його лікування. Єдиний шанс уникнути знущань з боку персоналу - втеча.',
        rating: 8.7,
        locate: 'США',
        url: 'https://vs0.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/One.Flew.Over.The.Cuckoos.Nest.1975.BDRip.1080p_480.mp4',
        actors: 'Джек Ніколсон, Луїза Флетчер, Бред Дуріф, Вільям Редфілд, Крістофер Ллойд',
        director: 'Мілош Форман',
        category: 'драма',
        id: 14,
        like: false,
        views: 500,
        view: false,
        comment: []
    },

    {
        name: 'Достукатись до неба',
        poster: 'https://image.kinokrad.co/p/f/1426156456_dostuchatsya-do-nebes.jpeg',
        date: 1997,
        description: 'Даний фільм є класикою, про який знає досить велика кількість глядачів, він геніальний, і справді захоплює. Ця картина починається з того, що двоє людей, абсолютно незнайомих один одному, їдуть на обстеження. Вони познайомилися в поїзді при не найприємніших обставин. Також разом вони дізнаються про свої ракових захворюваннях, і жити їм всього залишилося менше тижня. А почалося все з текіли, і моменту, коли два професійних кілера збили хлопчиська і заїхали в лікарню. А ці, під градусом і практично вмирають викрадають авто, так як не збираються помирати в лікарні. Більш того один з них ніколи не був на морі. З цього моменту і починається їх веселе і досить небезпечну подорож, яке здавалося довше всього прожитого життя, особливо коли жити залишилося максимум один тиждень. Після таких шедевральні подій і померти не страшно.',
        rating: 8.4,
        locate: 'Німеччина',
        url: 'https://vs0.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/Knockin.on.Heavens.Door.1997.BDRip.1080p_480.mp4',
        actors: 'Тіль Швайгер, Ян Йозеф Ліферс, Тіеррі Ван Вервеке, Мориц Бляйбтрой, Хуб Стапель',
        director: 'Томас Ян',
        category: 'драма, комедія, кримінал',
        id: 15,
        like: false,
        views: 644,
        view: false,
        comment: []
    },
    {
        name: 'Славні хлопці',
        poster: 'http://static.hdrezka.ac/i/2014/3/25/sf328c370d7c4tc52d90t.jpg',
        date: 1990,
        description: 'Кримінальна драма від майстра жанру Мартіна Скорсезе. Фільм вийшов воістину прекрасним, напруженим і драматичним. І глядачі, і критики залишилися задоволені побаченим, і картина заслужено отримала безліч нагород. Прекрасна режисерська робота укупі з неймовірним акторським складом, провідні ролі в якому зіграли Роберт Де Ніро, Рей Ліотта і Джо Пеші, напружені саундтреки і повороти сюжету поставили «Славних хлопців» на вершині всіх фільмів про мафіозі і зробили його класикою жанру. У фільмі прекрасно розкрита тема кодексу честі нагадав, і глядач переймається симпатією до негативних персонажів.',
        rating: 8.7,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd_4k/Goodfellas.1990.2160p_480.mp4',
        actors: 'Роберт Де Ніро, Рей Леотта, Джо Пеши, Лоррейн Бракко, Пол Сорвіно',
        director: 'Мартін Скорсезе',
        category: 'драма, кримінал',
        id: 16,
        like: false,
        views: 845,
        view: false,
        comment: []
    },

    {
        name: 'Престиж',
        poster: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQXcbCCDHNxVDTn0PE90v3xsueTk_IGjx9TIrKTwd1SR3AQyVEV',
        date: 2006,
        description: 'Альфред і Роберт є кращими фокусниками-ілюзіоніста, здатними вразити публіку. На рубежі XIX і XX століть вони були головними суперниками в своїй сфері. Але так склалося, що з роками те, що колись було простий дружній професійній конкуренцією, трансформується в непримиренну війну. Здається, що вони готові на все, аби вивідати один у одного секрети трюків, щоб надалі зірвати виконання суперника. Але постійні нападки один на одного і суперництво негативно впливають не тільки на них, а й на тих, хто оточує фокусників-ілюзіоністів. Протистояння загострюється і досягає свого піку. Фільм «Престиж», випущений в 2006 році режисером Крістофером Ноланом і заснований на однойменній драмі Крістофера Приста, дає глядачеві можливість побачити історію, що тримає в напрузі від самого початку і до фінальних титрів. Крістоферу Нолану, який пропрацював оригінальний твір зі своїм братом, вдалося створити таке видовище, під час перегляду якого глядач повністю занурюється в те, що відбувається на екрані, маючи можливість отримати непередавані відчуття.',
        rating: 8.5,
        locate: 'США, Британія',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd_4k/The.Prestige.2006.2160p_480.mp4',
        actors: 'Хью Джекмен, Крістіан Бейл, Майкл Кейн, Ребекка Холл, Скарлетт Йоханссон',
        director: 'Крістофер Нолан',
        category: 'фантастика, драма, триллер, детектив',
        id: 17,
        like: false,
        views: 945,
        view: false,
        comment: []
    },
    {
        name: 'Піаніст',
        poster: 'https://assets.catawiki.nl/assets/2018/6/7/6/0/a/60ac7572-7829-4cca-bbac-9b9596f95350.jpg',
        date: 2002,
        description: 'Життя для євреїв погіршується, нацистські власті позбавляють їх роботи і власного бізнесу, змушують носити відмітні знаки - синю пов^язку з Зіркою Давида. І це було лише початком, толерантне вторгнення і принципове расове розділення прийняло нові жахливі боку - коли дивимося онлайн фільм "Піаніст", то дізнаємося, що люди почали усвідомлювати, що все ще впереді.Уже до листопада сорокового року, Шпільман і його сім^я змушені з^їхати зі свого будинку і розміститися в переповненому Варшавському гетто, з жахливими умовами. Люди голодують, жорстокі охоронці не вважають полонених за людей і з легкістю залишають гнити трупи на вулиці, а піаністу ще тільки належить побачити весь жах війни ...',
        rating: 8.5,
        locate: 'Польща',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_30/The.Pianist.2002.D.BDRip.1080p_480.mp4',
        actors: 'Едріан Броуді, Умілія Фокс, Даніель Кальтаджироне, Ед Стоппард, Морін Ліпман',
        director: 'Роман Поланскі',
        category: 'біографія, драма, військовий',
        id: 18,
        like: false,
        views: 805,
        view: false,
        comment: []
    },
    {
        name: 'Мовчання ягнят',
        poster: 'https://st.kp.yandex.net/images/film_iphone/iphone360_345.jpg',
        date: 1990,
        description: '«Мовчання ягнят» - перша екранізація, що знайомить глядача з харизматичним, надзвичайно освіченою і делікатним, але, разом з цим, зловісним серійним вбивцею Ганнібалом Лектером, що вживають в їжу частини тіл своїх жертв.Буффало Білл - прізвисько невловимого серійного маніяка, який вбиває молодих жінок , здирає з них шкіру і вкладає в порожнину рота жертв кокони рідкісних метеликів. Відчайдушно намагаючись знайти хоч якусь зачіпку, здатну вивести на слід вбивці, керівництво Федерального бюро розслідувань вирішує вдатися до допомоги аналітичний склад розуму колишнього психіатра, а нині спійманого і полоненого маніяка-канібала Лектора.',
        rating: 8.6,
        locate: 'США',
        url: 'https://vs0.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/admin/molcaniye.yagniat_480.mp4',
        actors: 'Джуді Фостер, Ентоні Хопкінс, Брук Сміт, Скотт Гленн, Тед Левайн',
        director: 'Джонатан Демме',
        category: 'триллер, драма, детектив',
        id: 19,
        like: false,
        views: 999,
        view: false,
        comment: []
    },
    {
        name: 'Сім',
        poster: 'https://i.pinimg.com/originals/5b/4f/71/5b4f71e4356218f15e3e2e9149c8e308.jpg',
      date: 1995,
        description: '«Сім», геніальний фільм Девіда Фінчера про семи смертних гріхах, які намагається віддати за ці гріхи схильним їм людям маніяка (Кевін Спйесі), і намагаються впоратися з ним напарників Міллзі і Соммерсет (Б. Пітт і М. Фріман), - один з ідеальних фільмів для вашої золотої колекції трилерів. Фільм «Сім» починається, як крутий детектив: зі звірячого, але цілком «побутового» вбивства, яке новачок Міллз спочатку приписує сімейній сварці. Але досвідчений лейтенант Соммерсет намагається зрозуміти, чи не криється чогось більшого: у нього чуття на кепські історії. Незабаром приходить лист: маніяк затіває з детективами гру за своїми правилами. Глибина інтриги, зйомки на межі повернення до «нуар 50-их» і «неонуар», дощова похмура атмосфера (Фінчер дощу не "замовляв" - просто на знімальні дні випала така погода), похмурі сторони життя, - все це перетворює «Сім» в класику трилера.',
        rating: 8.6,
        locate: 'США',
        url: 'https://vs0.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/Se7en.1995.D.BDRip.1080p_480.mp4',
        actors: 'Бред Піт, Морган Фріман, Кевін Спейсі, Гвенет Петроу, Джон К. МакГінлі',
        director: 'Девід Фінчер',
        category: 'триллер, драма, детектив',
        id: 20,
        like: false,
        views: 998,
        view: false,
        comment: []
    },
    {
        name: 'Балканський рубіж',
        poster: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1000443.jpg',
        date: 2019,
        description: 'Дія драматичного бойовика «Балканський кордон», знятого російськими та сербськими кінематографістами, розгортається в Югославії зразка самого кінця минулого століття. Одна з російських груп спеціального призначення отримує негайний наказ терміново взяти під свій контроль важливий аеродром, розташований в Косово. Їм потрібно не тільки зайняти його, а й утримати до того моменту, поки не настигне підкріплення. І ніхто точно не може сказати, скільки все це може тривати. Незабаром з\'ясовується, що даний об\'єкт є стратегічно важливим. І він вкрай необхідний натовських генералів і одного албанському командиру, що знаходиться неподалік і готовому забрати об\'єкт в самий найближчий час. Група спеціального значення має прийняти цей нерівний бій. А в цей час до аеродрому вже спрямовуються сили НАТО і російські миротворці. Здається, що світ знову перебуває на порозі масштабної війни. Однак командиру групи не до політичних ігор, адже в аеропорту знаходиться його улюблена і вона в полоні у злочинців.',
        rating: 7.8,
        locate: 'Росія',
        url: 'https://vs0.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_30/Balkanskiy.Rubezh.2019.iTunes.WEBDL.1080p_480.mp4',
        actors: 'Антон Пампушний, Гоша Куценко, Мілош Бикович, Милена Радулович, Гойко Митич',
        director: 'Андрій Волгін',
        category: 'драма, бойовик',
        id: 21,
        like: false,
        views: 945,
        view: false,
        comment: []
    },
    {
        name: 'Капітан Марвел',
        poster: 'https://ae01.alicdn.com/kf/HTB1ZbL3I9zqK1RjSZPcq6zTepXal/Jude.jpg_q50.jpg',
        date: 2019,
        description: 'Події фантастичного фільму «Капітан Марвел», заснованого на коміксах, розгортаються в 1995 році. У центрі сюжету виявляється дівчина на ім\'я Керол Денверс, що служить в ВПС США. Будучи досвідченим пілотом, вона знаходиться на хорошому рахунку у свого начальства і користується повагою у колег. Але дівчина навіть не підозрює, що незабаром її чекають серйозні життєві потрясіння. Починається все в той момент, коли Керол виявляється в самому центрі подій, які вона сама не розуміє. В мить структура її ДНК зливається з ДНК одного з воїнів інопланетної раси під назвою Кріі. В результаті вона отримує надприродні сили. З кожною хвилиною Керол все більше виявляє, що її тіло здатне на те, що раніше здавалося чимось фантастичним.',
        rating: 7.1,
        locate: 'США',
        url: 'https://vs0.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_30/Captain.Marvel.2019.BDRip.1080p_480.mp4',
        actors: 'Брі Ларсон, Джемма Чан, МакКенна Грейс, Джуд Лоу, Бен Мендельсон',
        director: 'Анна Боден',
        category: 'фантастика, бойовик',
        id: 22,
        like: false,
        views: 1001,
        view: false,
        comment: []
    },
    {
        name: 'Снігозбірник',
        poster: 'http://lostfilm.info/images/poster/548/5476648.jpg',
        date: 2019,
        description: 'Почавши перегляд британського фільму «Снігоприбиральник», глядач знайомиться з тихим сімейним людиною і працьовитим водієм по імені Нельс. Він живе в прекрасному і мальовничому курортному містечку в Скелястих горах, займаючись очищенням території від снігу. Місцеві жителі люблять його і поважають працю, що дозволяє утримувати зимові дороги завжди чистими. Нельс і його дружина живуть в комфортабельному будинку, маючи все необхідне для щасливого сімейного життя. А сам головний герой тільки недавно отримав звання «Громадянин року», ставши одним з найвідоміших городян. Однак тиха гірська життя закінчується в той момент, коли Нельс дізнається про те, що його рідний син був жорстоко вбитий впливовим злочинцем, що містить картель, що займається виробництвом і розповсюдженням наркотиків. І хоч Нельс розуміє, що злочинці можуть легко з ним розправитися, він розробляє план, який допоможе йому помститися за смерть дитини. Він використовує свої навички полювання і перетворюється зі звичайного мирного людини в кваліфікованого вбивцю.',
        rating: 6.3,
        locate: 'США',
        url: 'https://vs2.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_30/Cold.Pursuit.2019.D.iTunes.BDRip.1080p_480.mp4',
        actors: 'Ліам Нісон, Лора Дерн, Еммі Россам, Том Бейтман, Вільям Форсайт',
        director: 'Ханс Петтер Муланд',
        category: 'драма, бойовик, триллер',
        id: 23 ,
        like: false,
        views: 255,
        view: false,
        comment: []
    },
    {
        name: 'Як приручити дракона 3',
        poster: 'https://www.kino-teatr.ru/movie/posters/big/3/130373.jpg',
        date: 2019,
        description: 'Оповідання повнометражного сімейного мультфільму «Як приручити дракона 3» починається з розповіді про те, що колись вікінги і дракони жили в мирі та гармонії. Вони допомагали один одному і ніколи не конфліктували. Ця дружби була корисною і взаємовигідною. Однак, незважаючи на це, щирість була зруйнована. Це призвело до розладів, конфліктів і непорозумінь. І більше вікінги і дракони не ділять радість і горе. Але що ж сталося? Дія відбувається в той момент, коли на острові з\'являється якась Денна Фурія. Спочатку місцеві жителі просто проявляють інтерес, вважаючи, що від неї не слід очікувати нічого поганого. Але виявляється, що це не так. З цього моменту хороброму Іккінга і доброму Беззубик доведеться зіткнутися з по-справжньому безжальним і невтомний мисливцем, готовим винищувати драконів. Ця людина готова піти на будь-які жертви, щоб досягти свого результату. Але якщо мисливець досягне успіху, то буде зруйновано все, що так дорого головним героям.',
        rating: 7.6,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd/How.to.Train.Your.Dragon.3.2019.2160p.UHD.BDRip.x265.10bit.SDR_480.mp4',
        actors: 'Джей Барушель, Кейт Бланшетт, Крейг Фергюсон, Америка Феррера, Джона Хілл',
        director: 'Дін ДеБлуа',
        category: 'мультфільм',
        id: 24,
        like: false,
        views: 433,
        view: false,
        comment: []
    },
    {
        name: 'Міа і білий лев',
        poster: 'https://img.afisha.tut.by/static/media/340x0s/cover/0b/8/mia-i-belyy-lev-427510.jpg',
        date: 2018,
        description: 'На самому початку перегляду фільму «Дівчинка Міа і білий лев» ми знайомимося з молодою сім\'єю, яка планує переїхати з рідного Лондона на територію Південної Африки. І незабаром вони зможуть реалізувати задумане. У центрі історії виявляється одинадцятирічна дівчинка, яка вперше в своєму житті бачить нову країну. Нове місце проживання для неї сильно відрізняється від звичної Великобританії. Але саме в Африці вона заводить щиру дружбу з маленьким білим левеням. А через деякий час вони стають нерозлучними. Міа і її новий друг разом ростуть і багато часу проводять за іграми. А через три роки маленький левеня стає великим і дорослим представником сімейства котячих. Але саме в цей момент Міа дізнається про те, що батько збирається продати її друга мисливцям, які планують зробити з нього трофей. Дівчинка намагається врятувати лева, але стикається з нерозумінням батьків. Тоді вона приймає рішення бігти, взявши з собою свого друга. Але чи вийде у них врятуватися?',
        rating: 6.5,
        locate: 'Німеччина',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_01/Mia.I.BelY.LeFF.2O18.D.BDRip.1O8Op_480.mp4',
        actors: 'Даніа Де Вілье, Мелані Лоран, Ленглі Кірквуд, Райан Мак Леннан, Лайонел Ньютон',
        director: 'Жіль де Метр',
        category: 'драма, пригоди',
        id: 25,
        like: false,
        views: 178,
        view: false,
        comment: []
    },
    {
        name: 'Скло',
        poster: 'https://upload.wikimedia.org/wikipedia/ru/c/c9/%D0%9F%D0%BE%D1%81%D1%82%D0%B5%D1%80_%D1%84%D0%B8%D0%BB%D1%8C%D0%BC%D0%B0_%C2%AB%D0%A1%D1%82%D0%B5%D0%BA%D0%BB%D0%BE%C2%BB.jpg',
        date: 2019,
        description: 'Почавши перегляд фільму «Скло», глядач знайомиться з Кевіном, молодою людиною, яка страждає від множинного розлади особистості. Лікарі вважають його найнебезпечнішим з усіх людей, що зазнають труднощів через це захворювання. Вся справа в тому, що у Кевіна більше двох десятків осіб, які проявляються в залежності від ситуації. З цієї причини медики ретельно стежать за ним, намагаючись зрозуміти, чи може кількість особистостей збільшитися. Коли лікарі доходять до 23 можливих персон, які живуть в свідомості Кевіна, то приходять до висновку, що це його максимально можливе число. Однак через деякий час назовні виривається нова особистість, більш відома як «Звір».',
        rating: 6.8,
        locate: 'США',
        url: 'https://vs2.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_30/Glass.2019.D.iTunes.BDRip.1080p_480.mp4',
        actors: 'Аня Тейлор-Джой, Сара Полсон, Джеймс МакЕвой, Брюс Віллис, Семюел Л. Джексон',
        director: 'М. Найт Шьямалан',
        category: 'драма, триллер, фантастика',
        id: 26,
        like: false,
        views: 361,
        view: false,
        comment: []
    },
    {
        name: 'Аквамен',
        poster: 'https://images-na.ssl-images-amazon.com/images/I/71JGOXv98RL._SY606_.jpg',
        date: 2018,
        description: 'Головним героєм фантастичного фільму «Аквамен» виявляється Артур Каррі, батько якого десятиліття був відданим працівником маяка. Саме там батько центрального персонажа, незважаючи на своє самітництво, став свідком безлічі незрозумілих явищ. І там же він зустрів прекрасну Атланну, яка стала головною любов\'ю всього його життя. Результатом їх союзу стала поява на світ Артура. Каррі молодший ріс і з раннього дитинства відчував у собі неймовірну силу. Він не міг її пояснити і тому боявся будь-яких її проявів. Але через деякий час Артур навчився контролювати свої здібності. Він став швидко пересуватися, навчився переміщувати важкі предмети, вага яких здається для звичайної людини неймовірним. А пізніше Артур зміг навчитися перебувати під водою необмежений час і навіть спілкуватися з підводними мешканцями океану. Тоді він дізнався, що його мати була справжньою правителькою великої Атлантиди. Її вигнали багато років тому, але вона пообіцяла, що її син рано чи пізно займе місце правителя семи морів.',
        rating: 7.1,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd/Aquaman.2018.IMAX.bdriP.216Op.sdr.x265.10bit_480.mp4',
        actors: 'Джейсон Момоа, Ембер Херд, Дольф Лундгрен, Ніколь Кідман, Джулі Ендрюс',
        director: 'Джеймс Ван',
        category: 'Фантастика, бойовик',
        id: 27,
        like: false,
        views: 471,
        view: false,
        comment: []
    },
    {
        name: 'Бамбелбі',
        poster: 'https://st.kp.yandex.net/images/film_iphone/iphone360_952241.jpg',
        date: 2018,
        description: 'Дія фантастичного фільму «Бамблби» починається в другій половині вісімдесятих років минулого століття. У центрі сюжету опиняється молода дівчина на ім\'я Чарлі. Вона юна і сповнена сил. Скоро вона досягне повноліття і тому щиро прагне знайти своє покликання і місце в житті. Вона пробує себе в самих різних галузях, але ніяк не може знайти те, до чого буде лежати її серце. Чарлі навіть не підозрює, що незабаром її життя зміниться раз і назавжди. Одночасно з цим ми спостерігаємо за трансформером на ім\'я Бамблби. Намагаючись сховатися від переслідування ворогів, він виявляє притулок на величезній автомобільної звалищі, розташованої в невеликому містечку Каліфорнії. Саме тут живе Чарлі. І зовсім випадково дівчина наштовхується на Бамблби. Спочатку вона не може повірити своїм очам, але незабаром усвідомить, що все побачене є правдою. Дівчина відчуває жалість до зломленому і покручені трансформеру. Чарлі призводить його до тями і починає допомагати йому.',
        rating: 6.9,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd/Bumblebee.2018.2160p.BDRip.x264.8bit.SDR_480.mp4',
        actors: 'Хейлі Стайнфелд, Анджела Бассетт, Джастін Теру, Памела Адлон, Джон Сіна',
        director: 'Трэвіс Найт',
        category: 'фаантастика, бойовик',
        id: 28,
        like: false,
        views: 207,
        view: false,
        comment: []
    },
    {
        name: 'Веном',
        poster: 'https://www.film.ru/sites/default/files/movies/posters/28569082-1054771.jpg',
        date: 2018,
        description: 'На самому початку перегляду фільму «Веном» ми знайомимося з Едді Броком, людиною з непростою долею. Його мати загинула під час пологів, а батько, звинувачуючи сина в смерті своєї коханої, завжди ставився до нього прохолодно. Хлопчик намагався отримати схвалення батьків, але не допомогли ні успіхи в спорті, ні хороші оцінки. Едді хотів стати атлетом, але вирішив вибрати професію журналіста після вивчення Уотергейтського скандалу. Серія драматичних подій призводить до того, що зломлений постійними катастрофами в особистому та професійному житті Едді вирішує перервати своє життя. Однак завдяки випадку він виявляється поруч з симбиот. Інопланетна субстанція, відчувши відчай, гнів і лють Брока, вирішує злитися з ним. Отримавши нові сили, Едді швидко виліковується. Він приймає цей подарунок як порятунку. Здогадується він про те, що симбиот використовує його в своїх цілях? Він харчується його негативом і змінює характер Брока. І чим довше Едді взаємодіє з симбиот, тим більше незворотними виявляються наслідки. Однак саме завдяки інопланетної сутності народжується Веном.',
        rating: 6.7,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd/Venom.2018.2160p.BDRip.x265.10bit.SDR.HDRezka.Master5_480.mp4',
        actors: 'Том Харді, Мішель Вільямс, Том Холланд, Вуді Харрельсон, Дженні Слейт',
        director: 'Рубен Фляйшер',
        category: 'фантастика, триллер, бойовик',
        id: 29,
        like: false,
        views: 442,
        view: false,
        comment: []
    },
    {
        name: 'Наркокурєр',
        poster: 'https://images-na.ssl-images-amazon.com/images/I/51izsAJzPJL._SY500_.jpg',
        date: 2018,
        description: 'Головним героєм кримінально-драматичного трилера «Наркокур\'єр» з елементами детективу виявляється старий по імені Ерл Стоун, життя якого в останні роки зовсім не така, якою б йому хотілося. Колись у нього було все, про що він мріяв, але поступово життя почало занепадати. Зараз особистий бізнес Ерла знаходиться практично на межі повного розорення, а сам він розуміє, що може стати банкрутом і позбутися всього, що наживав роками. Відносини з дружиною зовсім не ладяться, тому Ерл відчуває себе самотнім. Погіршує ситуацію й те, що його діти вже давно не дають про себе знати, немов забувши про існування свого батька.',
        rating: 7.1,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_30/The.Mule.2018.BDRip.1080p_480.mp4',
        actors: 'Клінт Іствуд, Бредлі Купер, Таісса Фарміга, Елісон Іствуд, Майкл Пенья',
        director: 'Клінт Іствуд',
        category: 'триллер, драма, кримінал',
        id: 30,
        like: false,
        views: 295,
        view: false,
        comment: []
    },
    {
        name: 'Зелена книга',
        poster: 'https://www.golddisk.ru/goods_img/14/141662.jpg',
        date: 2018,
        description: 'Біографічна драма «Зелена книга» з елементами комедії знайомить нас з людиною, яка здатна вразити оточуючих своєю витонченістю. Багато років він був зразком для наслідування багатьох людей, що знаходяться поруч з ним. І він не збирається нічого міняти в своєму житті. Йому подобається бути доглянутим, використовувати тільки грамотну мову і виробляти незабутнє враження своєю харизмою. І тому навколишні люди вважають його справжнім світським левом, який має багатий внутрішній світ і веде розкішний спосіб життя справжнього інтелігента, який захоплюється музикою. Одного разу герой наймає в якості свого охоронця і особистого водія людини, який не надто добре підходить для цієї роботи. Їм надається Тоні, більш відомий багатьом по кличці «Базіка». А звуть його так через те, що він хоч і є викидайлом, зовсім не вміє тримати язика за зубами. Він нічого не розуміє в етику й етикет, зате з радістю готовий побитися, якщо вважає, що його суперник цього заслуговує.',
        rating: 8.3,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd/Green.Book.2018.2160p.BluRay.x264.8bit.SDR_480.mp4',
        actors: 'Лінда Карделліні, Вігго Мортенсен, Махершала Алі, Дон Старк, П.Дж. Бірн',
        director: 'Пітер Фарреллі',
        category: 'комедія, драма',
        id: 31,
        like: false,
        views: 846,
        view: false,
        comment: []
    },
    {
        name: 'Ідеальна западина',
        poster: 'https://img.afisha.tut.by/static/media/340x0s/cover/06/f/idealnaya-zapadnya-376614.jpg',
        date: 2018,
        description: 'Молода пара відправляється на відпочинок в тихий куточок Італії, щоб врятувати свої відносини. Але у власника будинку, де вони оселилися, є зловісні плани на нових гостей.',
        rating: 5.2,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_30/Welcome.Home.2018.BDRip1080p_480.mp4',
        actors: 'Аарон Пол, Емілі Ратаковскі, Ріккардо Скамарчо, Кеті Луіз Саундерс, Дафна Александр',
        director: 'Джордж Ретліфф',
        category: 'триллер',
        id: 32,
        like: false,
        views: 81,
        view: false,
        comment: []
    },
        
    {
        name: 'Закопати в асвальт',
        poster: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1040748.jpg',
        date: 2018,
        description: 'Дія кримінально-драматичного бойовика «Загорнути в асфальт» з елементами трилера, знятого спільними зусиллями американських і канадських кінематографістів, починається в той момент, коли немолодий Ріджман, що має величезний досвід в пошуку злочинців, а також його приятель Ентоні, що відрізняється особливим зневагою до законів і нормам, виявляються в непростому положенні. Відбувається це в той момент, коли в глобальну мережу витікає відео, на якому відображені кадри, як вони жорстоко вибивають зізнання з людини, якого підозрюють у скоєнні злочину. Відразу ж після цього приятелів усувають від служби в поліції. Колишні поліцейські з жахом розуміють, що їхня репутація занадто сильно підмочена, а заробляти вони можуть тільки службою в поліції. Не маючи засобів до існування, друзі вирішують спробувати свої сили в світі криміналу, з яким боролися всі ці роки. Але вони не враховують, що на свободу в цей же час виходить чоловік, якого вони колись посадили за ґрати. І тепер він хоче помститися кривдникам.',
        rating: 7.1,
        locate: 'США',
        url: 'https://vs0.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_30/Dragged.Across.Concrete.2018.D.iTunes.BDRip.1080p_480.mp4',
        actors: 'Мел Гібсон, Вінс Вон, Дженніфер Карпентер, Лорі Холден, Майкл Джей Уайт',
        director: 'С. Крейг Залер',
        category: 'драма, триллер, бойовик',
        id: 33,
        like: false,
        views: 136,
        view: false,
        comment: []
    },
        
    {
        name: 'Грінч',
        poster: 'https://i.pinimg.com/736x/39/e1/6e/39e16e89b31f5bee29de31325571fa76.jpg',
        date: 2019,
        description: 'Події повнометражного анімаційного фільму «Як Грінч», призначеного для сімейного перегляду, починають розгортатися неподалік від дивного за своєю красою міста під назвою Ктограде. Саме тут в прихованій від сторонніх спостерігачів і відвідувачів печері мешкає злий, похмурий і незадоволений Грінч, дивна істота зеленого кольору. Багато років тому жителі містечка завдали йому серйозну образу - своєрідний зовнішній вигляд зробив його предметом насмішок для дітей і навіть дорослих. З того моменту Грінч зненавидів радість і всіх жителів міста. Він прийняв рішення піти від них і оселитися в тому місці, де його ніхто і ніколи не потурбує. У відповідь на глузування головний герой закрив своє серце від жителів і від добра. І тепер він коротає своє деньки в компанії пса на ім\'я Макс, який став єдиним його другом. Чим ближче наступ чергового свята, тим сильніше ненависть Гринча. Він вирішує зіпсувати жителям міста веселощі, тим самим відплативши за їх грубість, виявлену в минулому.',
        rating: 6.3,
        locate: 'США',
        url: 'https://cloud1.apollostream.xyz/video/861318/1/786163284/acbcf81826ab37c92cdc8ee02c77c73a.mp4',
        actors: 'Бенедикт Камбербетч',
        director: 'Ярроу Чейні',
        category: 'мультфільм',
        id: 34,
        like: false,
        views: 352,
        view: false,
        comment: []
    },
        
    {
        name: 'Хроніка хижих міст',
        poster: 'http://www.kinokadr.ru/filmzimg/m/mortalengines/mortalengines_poster.jpg',
        date: 2018,
        description: 'Неизвестная катастрофа поражает человеческую цивилизацию. С каждым днем становится все хуже, а люди понимают, что выжить смогут только сильнейшие и те, кто покажет способность к адаптации. События фильма «Хроники хищных городов» начинают разворачиваться спустя тысячу лет с того момента, как планету поразил апокалипсис. Человечеству удается выжить, но за это приходится заплатить высокую цену. Раса людей отныне живет по новым принципам и правилам. Новый мировой порядок изменил облик человеческой цивилизации. Теперь гигантские движущиеся города рассекают по пустошам и занимаются поглощением маленьких городов с целью потребления их ресурсов. В центре сюжета оказывается Том, человек, живущий в нижнем уровне Лондона. Он попадает в смертельную опасность в тот момент, когда на его пути внезапно и совершенно случайно появляется Эстер, бунтарка, скрывающаяся от слуг закона. Они не должны были встречаться, но теперь им вместе суждено изменить облик человечества.',
        rating: 6.1,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/uhd/Mortal.Engines.2018.2160p.bdriP.x264.8bit.SDR_480.mp4',
        actors: 'Хьюго Вінг, Роберт Шіен, Стівен Ленг, Колін Селмон, Гера Хілмарсдоттір',
        director: 'Крістіан Ріверс',
        category: 'триллер, фантастика',
        id: 35,
        like: false,
        views: 31,
        view: false,
        comment: []
    },
        
    {
        name: 'Мовчання',
        poster: 'http://kinozed.com/wp-content/uploads/2019/04/molchanie-2019_132867_0.jpg',
        date: 2019,
        description: 'Дія фільму жахів «Мовчання» починається в той момент, коли команда, що складається з досвідчених дослідників печер, які зробили чимало важливих наукових відкриттів, раптово знаходить невідомий людству вид древніх істот. На найперший погляд вони схожі на птерозаврів, але дослідники точно не впевнені. Для цього вони наближаються до істотам трохи ближче. Але ті, відчувши загрозу від вчених, люто нападають на дослідників. А відразу ж після цієї істоти розлітаються по найближчого міста. Ми знайомимося з шістнадцятирічної дівчиною на ім\'я Еллі, яка втратила слух три роки тому в автомобільній аварії. Того трагічного дня вона втратила бабусю і дідуся, а трагічні спогади переслідують її до сих пір. Разом зі своєю сім\'єю вона чує новини про те, що в їхньому місті введено надзвичайний стан. Уряд рекомендує їм залишатися вдома і нікуди не виходити. Однак родина Еллі починає розмірковувати над тим, щоб покинути місто і попрямувати в сільську місцевість, яка може бути одним з найбезпечніших місць.',
        rating: 5.2,
        locate: 'Німеччина',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd_30/The.Silence.2019.NF.WEB-DL.1080p_480.mp4',
        actors: 'Кірнан Шіпка, Стенлі Туччі, Міранда Отто, Джон Корбетт, Сара Ебботт',
        director: 'Джон Р. Леонетті',
        category: 'триллер',
        id: 36,
        like: false,
        views: 75,
        view: false,
        comment: []
    },
        
    {
        name: 'Доктор Стрейндж',
        poster: 'http://lostfilm.info/images/poster/546/5457656.jpg',
        date: 2017,
        description: 'І знову студія Діснея за допомогою постановника Скотта Дерріксона, переносить на екрани чергової «марвелловскій» комікс - на цей раз «Доктор Стрендж», про колишнього геніального нейрохірурга, який став Верховним Магом Землі. Хто міг би зіграти настільки ексцентричного і оригінального героя краще, ніж Бенедикт Камбербетч? І режисер «доктора Стренджа» не прогадав, довіривши основну роль цьому артисту. Події в кінокартині починаються динамічно, з пограбування чарівником-сектантом Кеціліем (Мадс Міккельсен) Чарівної Бібліотеки Старійшини магів всієї Землі, в той час як ще не опанувала усвідомленим чарами великий хірург Стрендж проводить унікальну і неповторну операцію разом з колегами - Христиною Палмер (Рейчел МакАдамс, персонажу якої теж судилося навчитися чарівництву) і Нікодімус Вестом.',
        rating: 7.5,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/Doctor.Strange.D.2016.BDRip.1080p_480.mp4',
        actors: 'Бенедикт Камбербутч, Тільда Суінтон, Мадс Міккельсен, Чіветель Еджіофор, Рейчал МакАдамс',
        director: 'Скотт Дерріксон',
        category: 'фантастика, бойовик',
        id: 37,
        like: false,
        views: 468,
        view: false,
        comment: []
    },
        
    {
        name: 'Капернаум',
        poster: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1118042.jpg',
        date: 2019,
        description: 'Драматичний фільм «Капернаум», знятий кінематографістами США і Лівану, знайомить нас з хлопчиком на ім\'я Зейн, який з раннього дитинства не з чуток знає про труднощі і тяготи життя. Живучи в злиденній бейрутської сім\'ї, кожен день він бачить потребу. І з цієї причини Зейн гостро усвідомлює, що його сім\'я відчайдушно потребує допомоги. Тому головний герой закидає навчання і відправляється на роботу. Він стежить за своїми сестрами і братами, допомагає по господарству і мріє, що знову повернеться до занять в школі. Але чим довше це триває, тим більше Зейн відчуває ненависть до світу, який змушує його жити в тяжких умовах. У головного героя є причини для ненависті, адже його родина ледве зводить кінці з кінцями. Кожен день Зейн повинен думати про те, чи зможуть його брати і сестри поїсти перед сном. Сам же він змушений регулярно працювати, гроблячи своє здоров\'я, коли діти благополучних сімей можуть спокійно займатися навчанням.',
        rating: 8.5,
        locate: 'США',
        url: 'https://vs1.cdnlast.com/s/2ebd523cf02e4191b1db5bdb4e5c642f1974e6/hd-nf19/Capharnam.2018.BDRip.1080p_480.mp4',
        actors: 'Зеін Л.Рефеа, Йорданос Шіферевб Феді Юсеф',
        director: ' Надін Лабакі',
        category: 'драма',
        id: 38,
        like: false,
        views: 103,
        view: false,
        comment: []
    }


];

  constructor() { }
}
